the 50770
<unk> 45020
<S> 42068
N 32481
of 24400
to 23638
a 21196
in 18000
and 17474
's 9784
that 8931
for 8927
$ 7541
is 7337
it 6112
said 6027
on 5650
by 4915
at 4894
as 4833
from 4724
million 4627
with 4585
mr. 4326
was 4073
be 3923
are 3914
its 3846
he 3632
but 3541
has 3494
an 3477
n't 3388
will 3270
have 3245
new 2793
or 2704
company 2680
they 2562
this 2438
year 2379
which 2362
would 2308
about 2220
says 2092
more 2065
were 2009
market 2005
billion 1881
his 1852
had 1850
their 1838
up 1785
u.s. 1774
one 1764
than 1731
who 1695
some 1668
been 1667
also 1617
stock 1611
other 1566
share 1511
not 1451
we 1397
corp. 1288
if 1281
when 1272
i 1262
last 1255
shares 1246
president 1246
years 1241
all 1227
first 1189
two 1184
trading 1159
because 1159
after 1137
could 1136
inc. 1132
sales 1126
& 1069
there 1068
out 1060
business 1031
only 1028
do 1011
such 1010
can 996
most 981
york 961
into 961
may 954
over 952
co. 939
group 928
many 922
government 885
now 875
federal 872
companies 870
no 861
time 847
bank 846
so 844
any 827
cents 826
people 794
quarter 791
you 790
exchange 786
prices 785
even 773
what 772
price 767
investors 761
say 755
rose 747
down 747
while 740
much 726
yesterday 722
week 720
under 719
securities 714
months 710
them 699
bonds 691
big 688
next 682
interest 679
three 665
earlier 652
net 651
' 651
earnings 647
make 646
major 646
state 644
american 636
financial 635
chairman 635
did 627
these 617
investment 614
board 612
through 611
still 611
stocks 609
those 606
just 605
chief 605
industry 602
executive 601
since 595
program 588
before 585
rate 579
made 577
officials 574
money 569
national 568
she 553
house 551
analysts 551
like 550
unit 547
month 546
off 545
expected 545
days 533
rates 532
japanese 527
against 526
plan 525
does 525
profit 524
between 509
both 506
capital 498
recent 493
sell 492
income 492
buy 492
issue 489
revenue 484
get 482
general 482
products 481
markets 480
firm 479
back 476
funds 475
own 471
ago 468
international 467
average 467
during 463
well 462
her 462
part 461
japan 459
fell 459
should 457
another 457
higher 453
debt 452
take 448
offer 448
including 445
court 444
among 444
being 443
each 442
according 442
index 440
tax 437
world 431
trade 431
reported 430
work 426
operations 424
then 422
past 420
computer 420
sale 419
way 416
our 416
however 416
lower 413
vice 412
plans 412
economic 410
yield 409
end 409
department 409
report 406
sold 402
insurance 401
high 400
growth 400
how 399
increase 397
foreign 397
less 396
common 395
several 394
closed 394
banks 394
issues 391
where 386
very 385
loss 385
yen 384
pay 384
bush 383
bid 381
five 378
due 377
few 376
bill 376
used 372
good 372
current 371
management 370
early 369
cash 368
use 366
oil 366
costs 365
bond 364
day 363
system 360
public 360
third 359
director 359
're 359
traders 358
might 358
law 358
treasury 357
friday 356
office 352
added 352
city 351
congress 350
futures 347
concern 347
officer 344
far 344
late 343
fund 342
already 342
number 341
least 341
california 341
assets 341
operating 340
spokesman 339
small 339
him 339
agency 338
british 337
too 335
san 335
based 335
real 334
case 334
value 333
news 333
september 332
same 331
oct. 330
until 329
think 328
contract 328
union 327
street 327
stake 327
research 327
home 327
close 327
services 324
going 323
today 321
little 320
ended 319
though 318
wall 316
move 316
agreement 315
dollar 314
help 313
second 312
put 310
service 309
former 306
power 305
maker 304
period 303
called 303
results 302
total 301
agreed 301
administration 301
third-quarter 300
here 300
four 300
without 298
long 296
control 296
problems 295
economy 295
credit 295
corporate 295
offering 294
want 292
country 292
production 291
loans 289
cost 289
buying 289
six 288
analyst 287
firms 285
annual 284
although 284
whether 283
increased 283
likely 282
compared 282
recently 281
policy 281
point 281
notes 281
committee 281
cut 280
see 279
west 278
large 275
soviet 273
right 273
monday 273
set 272
half 272
go 272
continue 272
around 272
political 271
life 270
losses 269
further 269
points 268
old 268
volume 267
yet 266
august 265
selling 264
paper 264
john 263
plant 262
judge 262
strong 261
must 261
my 260
expects 260
ual 259
nov. 259
london 258
result 257
largest 256
declined 256
announced 256
support 254
held 253
fiscal 253
wo 252
systems 252
francisco 251
weeks 250
times 250
takeover 250
priced 249
making 249
earthquake 248
certain 248
workers 247
gain 247
composite 247
change 247
become 247
problem 246
come 246
businesses 246
south 245
demand 244
record 243
industrial 243
give 243
nearly 241
white 240
series 240
senior 240
inc 240
development 240
association 240
dow 239
area 238
members 237
took 236
estimated 236
data 236
air 236
orders 235
official 235
trust 234
employees 234
jones 233
estate 233
decline 230
level 229
show 228
senate 228
line 228
latest 227
later 227
health 227
junk 226
example 226
drop 226
comment 226
acquisition 226
tuesday 225
meeting 225
commission 225
need 224
know 224
holding 224
ford 224
commercial 224
your 223
texas 223
chicago 223
building 223
ms. 222
despite 222
proposal 221
paid 221
currently 221
addition 221
possible 220
others 220
offered 220
executives 220
rise 219
purchase 219
proposed 219
once 219
deal 219
loan 218
better 218
technology 217
return 217
us 216
investor 216
spending 215
nation 215
future 215
nine 214
drug 214
washington 213
robert 213
changes 213
almost 213
received 212
often 212
damage 212
terms 211
product 211
east 211
october 210
named 210
expect 209
top 208
filed 207
customers 207
charge 207
within 206
order 206
information 206
decision 206
position 205
rights 204
include 204
force 204
defense 204
gas 203
every 203
division 203
america 202
amount 201
enough 200
began 200
came 199
trying 198
outstanding 198
europe 198
told 197
private 197
equipment 197
found 196
industries 195
gains 195
ltd. 194
again 194
dropped 193
united 192
programs 192
previous 192
makes 192
james 192
transaction 191
july 191
fed 191
computers 191
ca 191
european 190
budget 190
banking 190
following 189
finance 189
co 189
warner 188
provide 188
never 188
local 188
jaguar 188
've 188
mortgage 187
lot 187
consumer 187
additional 187
managers 186
keep 186
corp 186
able 186
shareholders 185
important 185
buy-out 185
action 185
great 184
university 183
instead 183
got 183
claims 183
charges 183
units 182
steel 182
states 182
car 182
best 182
away 182
tokyo 181
financing 181
dollars 181
things 180
construction 180
marketing 179
manager 179
continued 179
run 178
bills 177
asked 177
low 176
auto 176
march 175
inflation 175
family 175
fall 175
whose 174
june 174
food 174
equity 174
believe 174
sept. 173
advertising 173
above 173
raise 172
personal 172
below 172
suit 171
posted 171
lost 171
getting 171
full 171
account 171
taken 170
soon 170
los 170
head 170
china 170
stores 169
rather 169
via 168
risk 168
contracts 168
western 167
security 167
potential 167
included 167
special 166
restructuring 166
options 166
legal 166
figures 166
boston 166
tv 165
subsidiary 165
reports 165
mrs. 165
led 165
gold 165
using 164
place 164
noted 164
face 164
fact 163
dealers 163
working 162
open 162
meanwhile 162
network 161
holders 161
d. 161
countries 161
find 160
effort 160
statement 159
probably 159
portfolio 159
itself 159
cases 159
bought 159
available 159
approved 159
pacific 158
long-term 158
lawyers 158
ibm 158
effect 158
# 158
short 157
david 157
reached 156
left 156
increases 156
ad 156
labor 155
efforts 155
cars 155
airlines 155
remain 154
germany 154
either 154
domestic 154
dividend 154
along 154
similar 153
known 153
talks 152
hard 152
reduce 151
look 151
secretary 150
school 150
saying 150
reserve 150
previously 150
having 150
groups 150
chemical 150
center 150
calls 150
telephone 149
payments 149
party 149
parent 149
given 149
gained 149
clear 149
canada 149
approval 149
looking 148
individual 148
eastern 148
standard 147
profits 147
north 147
manufacturing 147
canadian 146
biggest 146
slightly 145
savings 145
investments 145
helped 145
acquired 145
strategy 144
raised 144
directors 144
angeles 144
marks 143
machines 143
black 143
attorney 143
why 142
television 142
percentage 142
military 142
institute 142
coming 142
bay 142
act 142
performance 141
medical 141
makers 141
clients 141
airline 141
team 140
heavy 140
german 140
energy 140
different 140
britain 140
interests 139
hit 139
growing 139
william 138
something 138
remains 138
particularly 138
magazine 138
lead 138
failed 138
estimates 138
communications 138
went 137
limited 137
levels 137
job 137
fees 137
completed 137
call 137
year-earlier 136
role 136
question 136
process 136
michael 136
joint 136
includes 136
hong 136
view 135
project 135
lines 135
legislation 135
goods 135
district 135
activity 135
toward 134
property 134
merrill 134
me 134
leading 134
free 134
columbia 134
venture 133
seeking 133
name 133
leaders 133
wants 132
reserves 132
rep. 132
institutions 132
ever 132
deficit 132
currency 132
independent 131
huge 131
concerns 131
'm 131
turn 130
taking 130
scheduled 130
s&p 130
owns 130
lynch 130
involved 130
young 129
vote 129
transportation 129
really 129
pressure 129
outside 129
kong 129
hold 129
gm 129
doing 129
buyers 129
build 129
producers 128
measure 128
calif. 128
begin 128
basis 128
april 128
always 128
staff 127
leader 127
especially 127
daily 127
care 127
brokerage 127
related 126
plants 126
means 126
key 126
themselves 125
richard 125
projects 125
disclosed 125
competition 125
aid 125
adds 125
acquire 125
try 124
reason 124
range 124
impact 124
drexel 124
conference 124
central 124
campaign 124
areas 124
started 123
significant 123
poor 123
largely 123
j. 123
hours 123
holdings 123
estimate 123
bad 123
abortion 123
thing 122
test 122
start 122
seems 122
reduced 122
meet 122
man 122
issued 122
french 122
allow 122
rules 121
retail 121
morgan 121
majority 121
course 121
accounts 121
wednesday 120
seven 120
quickly 120
press 120
needed 120
fourth 120
congressional 120
settlement 119
seen 119
partners 119
longer 119
journal 119
yields 118
traded 118
generally 118
done 118
december 118
community 118
'll 118
volatility 117
supply 117
manufacturers 117
dec. 117
consider 117
women 116
thursday 116
study 116
shearson 116
receive 116
parts 116
electric 116
beginning 116
thought 115
situation 115
simply 115
men 115
kind 115
imports 115
form 115
a. 115
turned 114
taxes 114
protection 114
prime 114
plc 114
planned 114
note 114
near 114
eight 114
convertible 114
brokers 114
subject 113
short-term 113
recession 113
history 113
filing 113
democratic 113
boost 113
auction 113
stock-index 112
space 112
sen. 112
required 112
rally 112
changed 112
ahead 112
worth 111
war 111
summer 111
seek 111
returns 111
produce 111
perhaps 111
dr. 111
became 111
base 111
arbitrage 111
software 110
showed 110
motor 110
moody 110
increasing 110
de 110
considered 110
caused 110
benefits 110
advanced 110
sent 109
housing 109
france 109
exports 109
delivery 109
creditors 109
brothers 109
anything 109
red 108
preferred 108
noriega 108
natural 108
justice 108
jumped 108
indeed 108
hurt 108
francs 108
owned 107
floor 107
express 107
entertainment 107
earned 107
difficult 107
continuing 107
cbs 107
cancer 107
bankers 107
americans 107
wanted 106
usually 106
shareholder 106
nothing 106
let 106
george 106
children 106
bankruptcy 106
active 106
per 105
merger 105
media 105
crash 105
closing 105
block 105
attempt 105
announcement 105
spokeswoman 104
smaller 104
pilots 104
minister 104
machine 104
evidence 104
digital 104
veto 103
sharply 103
seem 103
limit 103
irs 103
himself 103
hand 103
created 103
continues 103
article 103
resources 102
quake 102
partner 102
overseas 102
mark 102
light 102
won 101
unchanged 101
tons 101
thrift 101
source 101
size 101
sector 101
pound 101
night 101
initial 101
hugo 101
age 101
actually 101
term 100
side 100
minimum 100
apparently 100
water 99
transactions 99
session 99
regulators 99
questions 99
quarterly 99
member 99
kidder 99
game 99
environmental 99
directly 99
conditions 99
brand 99
post 98
hopes 98
giant 98
designed 98
comes 98
built 98
believes 98
moves 97
field 97
decided 97
closely 97
thus 96
survey 96
strike 96
produced 96
partly 96
main 96
letter 96
final 96
feel 96
woman 95
smith 95
sharp 95
separate 95
sense 95
running 95
rising 95
rest 95
response 95
play 95
paying 95
economists 95
behind 95
battle 95
associates 95
ways 94
sure 94
single 94
shows 94
sec 94
january 94
consumers 94
capacity 94
brought 94
'd 94
unless 93
supreme 93
stop 93
spent 93
sony 93
operation 93
offices 93
newspaper 93
leveraged 93
jobs 93
improve 93
hurricane 93
fully 93
effective 93
democrats 93
bring 93
allowed 93
ability 93
wage 92
u.k. 92
trial 92
rule 92
peter 92
par 92
idea 92
hope 92
gorbachev 92
followed 92
expenses 92
agencies 92
serious 91
r. 91
funding 91
forced 91
emergency 91
actual 91
whole 90
pretax 90
organization 90
discount 90
across 90
various 89
quoted 89
pension 89
package 89
guber 89
figure 89
dinkins 89
together 88
talk 88
slow 88
signed 88
reagan 88
quality 88
offset 88
needs 88
matter 88
introduced 88
holds 88
farmers 88
facilities 88
economist 88
direct 88
step 87
spring 87
require 87
provision 87
peters 87
payment 87
morning 87
moreover 87
jr. 87
headquarters 87
commerce 87
cause 87
valued 86
specific 86
sign 86
ruling 86
poland 86
plunge 86
partnership 86
land 86
interview 86
instance 86
human 86
greater 86
gave 86
flat 86
decade 86
county 86
civil 86
add 86
activities 86
trades 85
section 85
resigned 85
researchers 85
qintex 85
over-the-counter 85
opened 85
ministry 85
margins 85
lehman 85
leave 85
johnson 85
focus 85
elected 85
death 85
win 84
takes 84
sports 84
separately 84
santa 84
premium 84
institutional 84
forces 84
fear 84
familiar 84
existing 84
developed 84
declines 84
australia 84
valley 83
thomas 83
spend 83
safety 83
overall 83
nissan 83
moved 83
contributed 83
cable 83
avoid 83
widely 82
trader 82
southern 82
sometimes 82
salomon 82
review 82
owners 82
managing 82
conservative 82
chain 82
benefit 82
willing 81
provisions 81
electronic 81
develop 81
cuts 81
create 81
book 81
baker 81
authority 81
totaled 80
relatively 80
reflecting 80
provides 80
provided 80
properties 80
opposition 80
larger 80
indicated 80
improved 80
engineering 80
electronics 80
debentures 80
deals 80
beyond 80
bell 80
asset 80
appear 80
works 79
target 79
substantial 79
speculation 79
policies 79
met 79
measures 79
materials 79
hands 79
goes 79
backed 79
appears 79
stay 78
read 78
purchases 78
proceeds 78
offers 78
negative 78
motors 78
internal 78
individuals 78
houses 78
highly 78
date 78
council 78
climbed 78
brands 78
alone 78
version 77
tell 77
stanley 77
social 77
planning 77
pence 77
nasdaq 77
maintain 77
investigation 77
image 77
hutton 77
feet 77
adding 77
treatment 76
students 76
story 76
store 76
someone 76
so-called 76
reach 76
practice 76
passed 76
mutual 76
miles 76
lawyer 76
disaster 76
customer 76
class 76
carrier 76
appropriations 76
amounts 76
worked 75
regulatory 75
rating 75
publicly 75
prevent 75
positions 75
option 75
necessary 75
lawson 75
lawmakers 75
jury 75
interested 75
finally 75
everyone 75
education 75
drugs 75
consultant 75
cited 75
charles 75
chance 75
capital-gains 75
world-wide 74
tough 74
success 74
standards 74
soviets 74
republican 74
rejected 74
police 74
neither 74
negotiations 74
moving 74
minority 74
list 74
experts 74
else 74
commodity 74
bids 74
attributed 74
approach 74
swiss 73
stand 73
reorganization 73
raising 73
otc 73
nor 73
expectations 73
eventually 73
competitors 73
attention 73
ads 73
accounting 73
spread 72
sought 72
society 72
retirement 72
remaining 72
popular 72
petroleum 72
northern 72
mostly 72
mexico 72
manhattan 72
lack 72
heavily 72
grand 72
fixed 72
factors 72
entire 72
dividends 72
considering 72
typically 71
trend 71
real-estate 71
person 71
ownership 71
output 71
opening 71
ones 71
november 71
monetary 71
modest 71
magazines 71
immediately 71
giving 71
fight 71
export 71
chapter 71
brown 71
art 71
anyone 71
access 71
30-year 71
victims 70
scientists 70
saw 70
risks 70
reform 70
pentagon 70
particular 70
opportunity 70
mean 70
ltd 70
litigation 70
items 70
improvement 70
hour 70
gulf 70
forecast 70
film 70
exchanges 70
events 70
criminal 70
copper 70
bureau 70
bridge 70
usx 69
travel 69
regional 69
reduction 69
pending 69
municipal 69
moscow 69
monthly 69
minutes 69
laws 69
gives 69
everything 69
england 69
concerned 69
complete 69
college 69
bidding 69
aircraft 69
acquisitions 69
year-ago 68
weak 68
trouble 68
traditional 68
room 68
principal 68
park 68
owner 68
lose 68
lloyd 68
homes 68
gets 68
e. 68
details 68
design 68
cover 68
clearly 68
c$ 68
aimed 68
us$ 67
thatcher 67
strength 67
sources 67
restrictions 67
original 67
mortgages 67
maturity 67
experience 67
drive 67
claim 67
certainly 67
carry 67
broadcasting 67
apple 67
accept 67
wrote 66
true 66
troubled 66
thousands 66
subordinated 66
sort 66
requirements 66
relations 66
primarily 66
paul 66
parties 66
paribas 66
panel 66
increasingly 66
grow 66
global 66
fraud 66
facility 66
ending 66
easy 66
debate 66
crime 66
cray 66
couple 66
controls 66
combined 66
chinese 66
believed 66
vehicles 65
sun 65
split 65
segment 65
season 65
ratings 65
prepared 65
players 65
ohio 65
l. 65
involving 65
grew 65
difference 65
corn 65
tried 64
tomorrow 64
technical 64
roughly 64
revised 64
quite 64
publishing 64
prosecutors 64
producer 64
movie 64
mae 64
korea 64
highest 64
goldman 64
expansion 64
developing 64
chips 64
chemicals 64
centers 64
broad 64
arizona 64
alleged 64
waiting 63
st. 63
slowing 63
settled 63
sells 63
released 63
rated 63
profitable 63
powerful 63
plunged 63
painewebber 63
numbers 63
nations 63
mitsubishi 63
mail 63
listed 63
lin 63
launched 63
guilty 63
gene 63
expensive 63
except 63
employee 63
declining 63
damaged 63
consulting 63
automotive 63
actions 63
tests 62
sterling 62
schools 62
region 62
manville 62
live 62
intelligence 62
frank 62
flow 62
failure 62
corporations 62
competitive 62
collapse 62
buildings 62
bear 62
assistant 62
amid 62
am 62
advance 62
steps 61
slowdown 61
showing 61
republicans 61
represents 61
recovery 61
radio 61
putting 61
purchased 61
no. 61
navigation 61
m. 61
insurers 61
heart 61
headed 61
georgia-pacific 61
coupon 61
charged 61
associated 61
voters 60
values 60
uncertainty 60
trucks 60
signs 60
sachs 60
runs 60
request 60
predicted 60
portion 60
placed 60
phone 60
philip 60
nuclear 60
maybe 60
material 60
hundreds 60
favor 60
exxon 60
environment 60
effects 60
dozen 60
documents 60
devices 60
campeau 60
balance 60
appeal 60
ag 60
whom 59
ventures 59
utilities 59
unlike 59
underwriters 59
traffic 59
threat 59
successful 59
sears 59
release 59
reflects 59
primary 59
plus 59
paris 59
mind 59
mass. 59
lending 59
krenz 59
jack 59
hotel 59
fears 59
expand 59
elections 59
election 59
editor 59
dispute 59
complex 59
c. 59
affected 59
affairs 59
advertisers 59
adjusted 59
words 58
unusual 58
trillion 58
town 58
surged 58
stations 58
shift 58
relief 58
reasons 58
proposals 58
mixte 58
lincoln 58
fewer 58
exercise 58
elsewhere 58
deposits 58
century 58
alan 58
afternoon 58
accepted 58
virtually 57
usual 57
throughout 57
tender 57
structure 57
strategic 57
significantly 57
residents 57
professional 57
pretty 57
mixed 57
liability 57
junk-bond 57
jersey 57
golden 57
falling 57
faces 57
established 57
ease 57
controlled 57
continental 57
communist 57
cds 57
australian 57
annually 57
adviser 57
accord 57
wrong 56
truck 56
supplies 56
substantially 56
starting 56
speed 56
sides 56
sci 56
ready 56
practices 56
positive 56
opposed 56
normal 56
nbc 56
model 56
metals 56
margin 56
kept 56
hostile 56
hearing 56
healthy 56
guidelines 56
fire 56
february 56
distribution 56
deputy 56
client 56
cities 56
break 56
books 56
baseball 56
at&t 56
accused 56
wide 55
weakness 55
w. 55
thrifts 55
telecommunications 55
star 55
sir 55
seemed 55
seats 55
push 55
present 55
ordered 55
opinion 55
mayor 55
losing 55
lee 55
leaving 55
hospital 55
finished 55
fine 55
defendants 55
dallas 55
critics 55
confidence 55
coast 55
certificates 55
boosted 55
benchmark 55
b. 55
weekend 54
uses 54
responsible 54
representatives 54
remained 54
puts 54
protect 54
pricing 54
played 54
panama 54
names 54
n.j. 54
moment 54
managed 54
mainly 54
liquidity 54
judges 54
instruments 54
highway 54
ground 54
gone 54
follows 54
florida 54
employment 54
double 54
deposit 54
decisions 54
core 54
broker 54
bigger 54
barrels 54
attorneys 54
amendment 54
agree 54
suggest 53
stopped 53
stephen 53
station 53
sea 53
reflected 53
reflect 53
producing 53
prior 53
phillips 53
per-share 53
parents 53
pace 53
operate 53
minor 53
ge 53
finding 53
families 53
doubt 53
decide 53
crude 53
conventional 53
challenge 53
burnham 53
blacks 53
bit 53
b.a.t 53
authorities 53
utility 52
urban 52
temporary 52
talking 52
soared 52
slipped 52
rumors 52
relationship 52
ounce 52
operates 52
older 52
none 52
nekoosa 52
models 52
leadership 52
influence 52
ii 52
front 52
frankfurt 52
felt 52
candidates 52
ask 52
appeals 52
advantage 52
abroad 52
wells 51
voted 51
suspended 51
suggested 51
stronger 51
statistics 51
settle 51
scandal 51
purchasing 51
pharmaceutical 51
patients 51
oakland 51
meetings 51
mccaw 51
keeping 51
interstate 51
intended 51
immediate 51
houston 51
event 51
equal 51
delay 51
cutting 51
courts 51
contrast 51
africa 51
aerospace 51
wife 50
wang 50
voice 50
twice 50
sugar 50
studies 50
shopping 50
save 50
preliminary 50
pages 50
movies 50
morris 50
mca 50
joseph 50
italy 50
guarantee 50
goal 50
fannie 50
fairly 50
extremely 50
discussions 50
direction 50
determined 50
consultants 50
confirmed 50
compromise 50
citing 50
church 50
chrysler 50
boeing 50
assistance 50
alternative 50
affect 50
worry 49
wake 49
training 49
task 49
structural 49
six-month 49
silver 49
senators 49
safe 49
river 49
rich 49
represent 49
replace 49
prove 49
negotiating 49
luxury 49
lambert 49
hollywood 49
guarantees 49
gross 49
green 49
fourth-quarter 49
follow 49
flight 49
file 49
fe 49
disclose 49
declared 49
coverage 49
comparable 49
commitments 49
citicorp 49
buyer 49
argue 49
appeared 49
antitrust 49
written 48
warrants 48
volatile 48
usair 48
upon 48
swings 48
suggests 48
succeeds 48
shown 48
regular 48
records 48
promise 48
professor 48
navy 48
movement 48
mining 48
living 48
la 48
jointly 48
joined 48
hud 48
happen 48
factory 48
denied 48
aug. 48
asking 48
advisers 48
word 47
weekly 47
vehicle 47
telerate 47
surge 47
style 47
served 47
saturday 47
s. 47
returned 47
responsibility 47
resolution 47
regulations 47
refused 47
providing 47
patent 47
one-time 47
hill 47
georgia 47
drives 47
door 47
discovered 47
damages 47
cross 47
crisis 47
conn. 47
club 47
cd 47
beijing 47
ban 47
alliance 47
agreements 47
worried 46
votes 46
underlying 46
toronto 46
thinks 46
switzerland 46
square 46
sound 46
singapore 46
serve 46
saatchi 46
road 46
representing 46
reaction 46
politics 46
personnel 46
matters 46
machinists 46
jan. 46
invest 46
insured 46
initially 46
hewlett-packard 46
helping 46
games 46
farm 46
f. 46
extra 46
exploration 46
excess 46
edward 46
critical 46
chip 46
chase 46
ceiling 46
carolina 46
views 45
ultimately 45
type 45
title 45
tend 45
temporarily 45
shipping 45
setting 45
scientific 45
s.a. 45
rival 45
politicians 45
picture 45
pact 45
operator 45
obtain 45
nobody 45
mine 45
membership 45
louis 45
looks 45
lives 45
language 45
jump 45
join 45
illegal 45
high-yield 45
happened 45
fallen 45
extraordinary 45
entered 45
ec 45
easily 45
discuss 45
covered 45
condition 45
coffee 45
audience 45
army 45
argued 45
aids 45
1980s 45
worse 44
taxpayers 44
suffered 44
specialists 44
ross 44
resignation 44
reporting 44
reporters 44
publisher 44
prospects 44
proceedings 44
piece 44
phelan 44
pass 44
p.m. 44
normally 44
newly 44
nature 44
millions 44
manufacturer 44
lowered 44
letters 44
lawsuits 44
investing 44
intel 44
indicate 44
import 44
h. 44
grain 44
giants 44
generation 44
fields 44
fair 44
eye 44
expressed 44
described 44
costly 44
controversial 44
colleagues 44
circuit 44
choice 44
branch 44
agents 44
abc 44
watch 43
urged 43
understand 43
types 43
ties 43
technologies 43
t. 43
student 43
strategies 43
spot 43
simple 43
sets 43
semiconductor 43
rjr 43
rapidly 43
pushed 43
presence 43
p&g 43
outlook 43
n.y. 43
launch 43
king 43
israel 43
intends 43
inside 43
heat 43
health-care 43
fuel 43
founder 43
factor 43
extent 43
died 43
deliver 43
coup 43
costa 43
consecutive 43
concluded 43
attract 43
aggressive 43
adopted 43
administrative 43
acquiring 43
1970s 43
10-year 43
warned 42
voting 42
visit 42
unable 42
track 42
tied 42
succeed 42
stearns 42
stage 42
specialty 42
slide 42
restaurant 42
resistance 42
pursue 42
possibility 42
pictures 42
philadelphia 42
ogilvy 42
offerings 42
obligation 42
miller 42
metric 42
integrated 42
household 42
hearings 42
hampshire 42
guaranteed 42
graphics 42
genes 42
garden 42
formed 42
enterprises 42
ensure 42
corporation 42
committed 42
commissions 42
cold 42
child 42
basic 42
atlantic 42
agent 42
worst 41
two-year 41
supported 41
studio 41
shipments 41
rico 41
retailers 41
reforms 41
reducing 41
realize 41
ratio 41
quarters 41
processing 41
privately 41
pick 41
participants 41
music 41
mother 41
limits 41
league 41
knows 41
invested 41
forecasts 41
extended 41
exposure 41
excluding 41
enormous 41
differences 41
crop 41
criticism 41
contends 41
constitutional 41
comments 41
circumstances 41
christmas 41
check 41
chancellor 41
card 41
b 41
assume 41
asia 41
write 40
warning 40
users 40
unlikely 40
triggered 40
status 40
ship 40
roll 40
pittsburgh 40
pipeline 40
pennsylvania 40
nyse 40
mountain 40
mitchell 40
line-item 40
lenders 40
lang 40
hungary 40
governments 40
genetic 40
football 40
faster 40
easier 40
culture 40
creating 40
cooperation 40
commitment 40
collapsed 40
coal 40
carriers 40
career 40
brooks 40
breeden 40
begun 40
beer 40
becoming 40
banco 40
attack 40
anticipated 40
affiliate 40
widespread 39
unemployment 39
tumbled 39
tower 39
suits 39
stock-market 39
speech 39
signal 39
secondary 39
ruled 39
rooms 39
retailing 39
requires 39
quick 39
published 39
possibly 39
otherwise 39
newspapers 39
modern 39
messrs. 39
match 39
martin 39
lawrence 39
inventories 39
hills 39
heard 39
grown 39
friends 39
friendly 39
frequently 39
formerly 39
foods 39
father 39
fashion 39
facing 39
faced 39
extend 39
douglas 39
democracy 39
default 39
currencies 39
commodities 39
code 39
citizens 39
cells 39
carried 39
calling 39
calif 39
branches 39
brady 39
beach 39
banker 39
awarded 39
walter 38
unsecured 38
turns 38
turning 38
thin 38
supposed 38
subcommittee 38
stories 38
son 38
seeks 38
retain 38
ran 38
prospect 38
progress 38
playing 38
peabody 38
observers 38
networks 38
moderate 38
merely 38
merchandise 38
massive 38
hunt 38
handle 38
gop 38
gasoline 38
filled 38
expense 38
expanded 38
equivalent 38
encourage 38
employers 38
donald 38
disappointing 38
contributions 38
cellular 38
caught 38
carries 38
brewing 38
badly 38
attractive 38
atlanta 38
approve 38
apply 38
answer 38
alternatives 38
after-tax 38
yeargin 37
troubles 37
transfer 37
tobacco 37
surprising 37
surprised 37
sunday 37
storage 37
steady 37
spain 37
sophisticated 37
site 37
sees 37
resume 37
recorded 37
race 37
pushing 37
pulled 37
prompted 37
predict 37
population 37
pilot 37
orange 37
nicaragua 37
metal 37
memory 37
maxwell 37
machinery 37
mac 37
impossible 37
identified 37
hired 37
handling 37
hall 37
guy 37
gap 37
fellow 37
fast 37
editorial 37
daniel 37
consolidated 37
closer 37
changing 37
causing 37
bringing 37
blood 37
assembly 37
appointed 37
applied 37
allegations 37
worker 36
wait 36
violations 36
video 36
viacom 36
three-month 36
threatened 36
thompson 36
theory 36
table 36
sudden 36
subsidiaries 36
specialist 36
severe 36
revenues 36
resulted 36
recalls 36
reading 36
pulp 36
profitability 36
priority 36
portfolios 36
player 36
plastic 36
parliament 36
ought 36
opec 36
one-year 36
numerous 36
northeast 36
nixon 36
nec 36
merchant 36
maximum 36
massachusetts 36
maintenance 36
lawsuit 36
introduce 36
insurer 36
honecker 36
hear 36
heads 36
harder 36
hanover 36
greenspan 36
franchise 36
flights 36
fast-food 36
establish 36
enforcement 36
eliminate 36
elaborate 36
educational 36
downturn 36
delays 36
dealing 36
complained 36
channel 36
cautious 36
bottom 36
boom 36
aside 36
applications 36
allowing 36
york-based 35
typical 35
two-thirds 35
turner 35
totaling 35
targets 35
surprise 35
statements 35
sluggish 35
shortly 35
shops 35
roman 35
rivals 35
retired 35
represented 35
regarding 35
rapid 35
purpose 35
promotion 35
promised 35
prison 35
organizations 35
operators 35
nikkei 35
nationwide 35
message 35
learned 35
kkr 35
kill 35
interest-rate 35
insist 35
industrials 35
indicates 35
india 35
illinois 35
fresh 35
freddie 35
foundation 35
formal 35
fighting 35
expanding 35
exceed 35
everybody 35
essentially 35
egg 35
developers 35
determine 35
dealer 35
dead 35
counsel 35
containers 35
consumption 35
connection 35
compensation 35
claimed 35
chamber 35
chains 35
carrying 35
campbell 35
bob 35
bloc 35
billions 35
announce 35
a$ 35
winter 34
wholesale 34
whatever 34
vs. 34
virginia 34
turnover 34
trends 34
theater 34
tape 34
supporters 34
successor 34
steinhardt 34
stands 34
soft 34
shot 34
shop 34
seat 34
reputation 34
reinsurance 34
prudential-bache 34
planners 34
payable 34
papers 34
packages 34
ortega 34
opportunities 34
one-third 34
officers 34
narrow 34
middle 34
mass 34
ltv 34
legislative 34
institution 34
husband 34
halt 34
governor 34
glass 34
fujitsu 34
freedom 34
fly 34
five-year 34
explain 34
exactly 34
engelken 34
desire 34
demands 34
delmed 34
cosmetics 34
constitution 34
comprehensive 34
compaq 34
color 34
buy-back 34
brief 34
blame 34
bellsouth 34
begins 34
bailout 34
aware 34
asset-backed 34
wonder 33
weaker 33
turmoil 33
strongly 33
standing 33
stable 33
somewhat 33
sensitive 33
schedule 33
scale 33
royal 33
rockefeller 33
retailer 33
resulting 33
restaurants 33
ranging 33
quiet 33
psyllium 33
procedures 33
places 33
mills 33
metropolitan 33
mesa 33
mci 33
icahn 33
holiday 33
harris 33
goals 33
generate 33
forms 33
fifth 33
exclusive 33
english 33
engineers 33
engine 33
el 33
efficient 33
du 33
des 33
daiwa 33
covering 33
corry 33
considerable 33
consensus 33
bulk 33
blue-chip 33
blue 33
besides 33
berlin 33
bar 33
baltimore 33
anc 33
aide 33
agriculture 33
aetna 33
advice 33
achieved 33
accounted 33
victory 32
variety 32
taiwan 32
surplus 32
spirits 32
slid 32
send 32
sell-off 32
registered 32
regime 32
pressures 32
poll 32
mich. 32
miami 32
marine 32
looked 32
location 32
learning 32
latin 32
las 32
jim 32
involve 32
initiative 32
incentives 32
hot 32
hardly 32
guide 32
gonzalez 32
gen. 32
friend 32
fit 32
expire 32
eggs 32
edison 32
economics 32
earth 32
doubled 32
donaldson 32
disk 32
delta 32
delayed 32
defensive 32
defend 32
deaths 32
dean 32
davis 32
convicted 32
convert 32
conducted 32
conduct 32
concept 32
competing 32
combination 32
cleveland 32
clean 32
broken 32
broader 32
brazil 32
behalf 32
beat 32
asian 32
arrangement 32
argument 32
apparent 32
airways 32
wine 31
weapons 31
wave 31
waste 31
van 31
trip 31
sotheby 31
shall 31
sellers 31
seeing 31
round 31
rock 31
rey 31
responded 31
respond 31
requiring 31
repair 31
renewed 31
recapitalization 31
reasonable 31
purposes 31
program-trading 31
principle 31
precious 31
poverty 31
pont 31
permanent 31
peace 31
occurred 31
merc 31
meant 31
linked 31
lilly 31
island 31
indian 31
identify 31
hoped 31
guard 31
forest 31
favorable 31
experiments 31
enter 31
engaged 31
effectively 31
edition 31
eased 31
districts 31
distributed 31
discussing 31
device 31
departure 31
democrat 31
confident 31
compete 31
collection 31
broke 31
borrowing 31
body 31
arthur 31
arm 31
answers 31
allianz 31
allen 31
address 31
acts 31
abandoned 31
a.m. 31
writer 30
wild 30
whites 30
westinghouse 30
wcrs 30
watching 30
toyota 30
testing 30
tentatively 30
telling 30
teams 30
syndicate 30
sustained 30
suspension 30
sufficient 30
suffer 30
succeeded 30
strip 30
stadium 30
solid 30
shut 30
shell 30
senator 30
secured 30
secret 30
scott 30
science 30
scenario 30
risen 30
reluctant 30
recommended 30
rebound 30
rape 30
premiums 30
pollution 30
poison 30
plenty 30
plastics 30
pilson 30
packaging 30
noting 30
newport 30
nevertheless 30
monitor 30
mobil 30
miss 30
mergers 30
mary 30
marshall 30
manage 30
malcolm 30
mainframe 30
lufkin 30
loyalty 30
ideas 30
henry 30
handful 30
fleet 30
fill 30
filings 30
earn 30
duties 30
divisions 30
developer 30
detroit 30
delivered 30
deep 30
crucial 30
credibility 30
creative 30
coors 30
connecticut 30
concrete 30
compares 30
coke 30
coca-cola 30
circulation 30
causes 30
buy-outs 30
brain 30
becomes 30
akzo 30
afford 30
younger 29
webster 29
waertsilae 29
underwriter 29
timing 29
thomson 29
teachers 29
subsidies 29
stood 29
sit 29
simmons 29
sheet 29
sex 29
ride 29
remic 29
projections 29
productivity 29
powers 29
phoenix 29
permission 29
oppose 29
onto 29
nomura 29
michigan 29
mcdonald 29
marketplace 29
license 29
killed 29
judicial 29
intent 29
intense 29
inquiry 29
indicating 29
imported 29
host 29
helps 29
hahn 29
gov. 29
germans 29
fundamental 29
feeling 29
fans 29
experienced 29
encouraged 29
eager 29
driving 29
drew 29
dramatic 29
downward 29
difficulties 29
decades 29
d.c. 29
cycle 29
crowd 29
criticized 29
credits 29
copy 29
conservatives 29
complaints 29
commonwealth 29
christopher 29
cheaper 29
cheap 29
charging 29
caution 29
cast 29
candidate 29
biotechnology 29
basket 29
attempting 29
assumption 29
assuming 29
approximately 29
amr 29
abortions 29
zealand 28
wood 28
wish 28
viewed 28
vegas 28
unions 28
treaty 28
totally 28
tight 28
telegraph 28
succeeding 28
stone 28
steep 28
stateswest 28
starts 28
sons 28
slump 28
selected 28
sciences 28
requested 28
replaced 28
remarks 28
relative 28
regulation 28
refinery 28
referring 28
recover 28
promote 28
planes 28
pinkerton 28
pill 28
owed 28
overnight 28
originally 28
organized 28
opponents 28
nervous 28
nasa 28
mips 28
milk 28
merksamer 28
maynard 28
marcos 28
lies 28
liberal 28
legislators 28
korean 28
kids 28
kennedy 28
interbank 28
indicators 28
imposed 28
holder 28
giuliani 28
gamble 28
g. 28
freeway 28
foreign-exchange 28
flying 28
fla. 28
falls 28
dutch 28
draw 28
divided 28
developments 28
detailed 28
dealings 28
counter 28
consideration 28
comfortable 28
cia 28
checks 28
catch 28
carnival 28
cards 28
capped 28
calculated 28
blamed 28
bikes 28
backing 28
automobile 28
author 28
audit 28
appreciation 28
allies 28
aggressively 28
acting 28
acknowledged 28
winning 27
visitors 27
vary 27
thinking 27
technique 27
swap 27
sued 27
stress 27
straight 27
steven 27
stated 27
start-up 27
speculators 27
showtime 27
sam 27
rural 27
retire 27
restore 27
resort 27
rescue 27
representative 27
remove 27
receipts 27
readers 27
rare 27
raises 27
publications 27
proved 27
promises 27
programming 27
presidential 27
presented 27
polish 27
permitted 27
penalty 27
penalties 27
participation 27
obvious 27
mgm 27
mercantile 27
memories 27
medicine 27
mature 27
maryland 27
maintained 27
load 27
lewis 27
leads 27
labor-management 27
joining 27
indictment 27
indication 27
handled 27
gyrations 27
grants 27
gary 27
galileo 27
freight 27
founded 27
foot 27
fixed-rate 27
fired 27
findings 27
features 27
farmer 27
famous 27
expert 27
exist 27
entirely 27
ends 27
emerging 27
disease 27
disappointed 27
departments 27
deadline 27
curb 27
controversy 27
controlling 27
contras 27
cleared 27
category 27
carl 27
businessmen 27
burden 27
boren 27
bet 27
bartlett 27
barney 27
barely 27
attitude 27
asbestos 27
appropriate 27
apart 27
anybody 27
analysis 27
allegedly 27
african 27
activists 27
writing 26
warren 26
warrant 26
trelleborg 26
transport 26
tone 26
ticket 26
three-year 26
texaco 26
tells 26
takeovers 26
streets 26
stakes 26
slower 26
shape 26
sentiment 26
seidman 26
second-largest 26
seasonally 26
screen 26
roger 26
rica 26
revive 26
resolved 26
remember 26
reductions 26
recovered 26
realized 26
rallied 26
prefer 26
pounds 26
potentially 26
polls 26
plea 26
permit 26
pattern 26
participate 26
paramount 26
p. 26
outlets 26
outcome 26
optimistic 26
odds 26
occur 26
nonetheless 26
minneapolis 26
midwest 26
merge 26
love 26
lists 26
link 26
leverage 26
leaves 26
knew 26
jenrette 26
iowa 26
imperial 26
ill. 26
howard 26
hoping 26
high-risk 26
happens 26
grant 26
gnp 26
gandhi 26
fox 26
foreigners 26
financially 26
fda 26
fbi 26
false 26
emphasis 26
drilling 26
discussed 26
disclosure 26
depending 26
definitive 26
courter 26
cotton 26
copies 26
contend 26
conner 26
committees 26
cohen 26
classes 26
cincinnati 26
choose 26
charities 26
character 26
cathay 26
busy 26
broadcast 26
breaking 26
behavior 26
bankruptcy-law 26
avenue 26
attracted 26
acres 26
zero-coupon 25
well-known 25
weight 25
weather 25
watched 25
vietnam 25
veteran 25
urging 25
unisys 25
unfair 25
travelers 25
traditionally 25
tools 25
theme 25
tennessee 25
supporting 25
submitted 25
state-owned 25
stability 25
somebody 25
slight 25
ships 25
search 25
scores 25
sanctions 25
saab 25
s&l 25
ronald 25
roberts 25
residential 25
recognition 25
raw 25
quebecor 25
ps 25
printing 25
pleaded 25
plays 25
philippines 25
perspective 25
pays 25
overhaul 25
obviously 25
obtained 25
negotiated 25
missing 25
malaysia 25
mainframes 25
lire 25
learn 25
kellogg 25
jeffrey 25
interesting 25
iii 25
hundred 25
hospitals 25
greatly 25
greatest 25
gotten 25
financier 25
fiat 25
favorite 25
failing 25
fail 25
factories 25
exceeded 25
era 25
eliminated 25
edge 25
economies 25
eagle 25
durable 25
downtown 25
display 25
discipline 25
difficulty 25
debts 25
credit-card 25
contractor 25
concentrate 25
completely 25
comparison 25
characters 25
cattle 25
casualty 25
capitol 25
canceled 25
bolster 25
boards 25
bloomingdale 25
bidders 25
bethlehem 25
authorized 25
attached 25
assumed 25
aspects 25
argues 25
apparel 25
anticipation 25
airport 25
admitted 25
academic 25
wpp 24
wolf 24
walls 24
wages 24
va. 24
train 24
ton 24
tom 24
tire 24
tiger 24
terrorism 24
taylor 24
taxable 24
sweeping 24
surprisingly 24
suddenly 24
subscribers 24
studying 24
struck 24
stem 24
squeeze 24
specified 24
solution 24
socialist 24
slowed 24
seriously 24
segments 24
seed 24
satellite 24
roy 24
rothschild 24
ringers 24
resolve 24
reset 24
republic 24
replacement 24
rebels 24
railroad 24
quotations 24
projected 24
produces 24
predicting 24
posts 24
pop 24
pool 24
plaintiffs 24
pieces 24
pharmaceuticals 24
peak 24
partnerships 24
partial 24
panamanian 24
novel 24
negotiable 24
monitoring 24
milton 24
mill 24
measured 24
master 24
located 24
lift 24
lebanon 24
lane 24
laboratories 24
jose 24
italian 24
insider 24
improvements 24
importance 24
hire 24
hastings 24
harvard 24
happy 24
gray 24
funded 24
franklin 24
forward 24
focusing 24
eyes 24
extensive 24
experiment 24
electricity 24
electrical 24
duty 24
donations 24
doctors 24
disasters 24
deny 24
dennis 24
degree 24
covers 24
cos. 24
correct 24
consequences 24
consent 24
complaint 24
complain 24
colgate 24
climate 24
cell 24
casino 24
borrowed 24
baby 24
attempts 24
associate 24
asks 24
arms 24
ariz. 24
amex 24
allows 24
aides 24
advised 24
adjustments 24
accident 24
1990s 24
wright 23
witter 23
whitbread 23
wars 23
walk 23
violation 23
vast 23
unveiled 23
uncertain 23
turnaround 23
turkey 23
tiny 23
testimony 23
surveyed 23
surrounding 23
supplier 23
stuff 23
struggling 23
structures 23
stockholders 23
stein 23
spill 23
spielvogel 23
specifically 23
sitting 23
sectors 23
scheme 23
scene 23
saudi 23
sand 23
row 23
risky 23
respectively 23
receiving 23
random 23
ralph 23
puerto 23
professionals 23
plummeted 23
plane 23
pa. 23
officially 23
neighborhood 23
necessarily 23
mortgage-backed 23
modestly 23
mix 23
missouri 23
mines 23
marina 23
manages 23
longtime 23
lone 23
legislature 23
involvement 23
investment-grade 23
inventory 23
injuries 23
hits 23
hefty 23
hardware 23
grace 23
focused 23
flag 23
fined 23
finds 23
fee 23
failures 23
explains 23
expires 23
expiration 23
evans 23
essential 23
edged 23
dynamics 23
diversified 23
depressed 23
depends 23
delaware 23
dangerous 23
crimes 23
converted 23
consistently 23
considerably 23
colorado 23
classic 23
cigarettes 23
chosen 23
charter 23
cap 23
bridges 23
boosting 23
blow 23
bells 23
barriers 23
barrel 23
bankamerica 23
assessment 23
approached 23
annualized 23
advocates 23
admits 23
adjustable 23
adequate 23
acceptance 23
abuse 23
worries 22
withdrawal 22
window 22
williams 22
versions 22
unfortunately 22
tw 22
tvs 22
triple-a 22
transferred 22
tool 22
toll 22
symbol 22
switch 22
subsequent 22
struggle 22
stick 22
spiegel 22
specialized 22
solutions 22
sole 22
smoking 22
slowly 22
ski 22
seoul 22
seasonal 22
samuel 22
revolution 22
retained 22
restructure 22
respondents 22
repurchase 22
reportedly 22
repeated 22
reality 22
racketeering 22
publish 22
protected 22
prospective 22
probe 22
pro 22
presidents 22
pleased 22
persuade 22
performed 22
path 22
page 22
operational 22
nearby 22
motion 22
moon 22
money-market 22
mikhail 22
merged 22
mentioned 22
matching 22
marked 22
male 22
loyal 22
lots 22
lease 22
lackluster 22
laboratory 22
kodak 22
kenneth 22
investigating 22
introduction 22
insists 22
insisted 22
injured 22
independence 22
incentive 22
implications 22
imf 22
house-senate 22
hooker 22
hiring 22
healthvest 22
fueled 22
florio 22
flexibility 22
federation 22
fat 22
fargo 22
evening 22
est 22
easing 22
dropping 22
dominated 22
doctor 22
dismissed 22
discounting 22
diluted 22
conviction 22
contractors 22
contained 22
conspiracy 22
conglomerate 22
confirm 22
concedes 22
complicated 22
compliance 22
commissioner 22
collateral 22
cocoa 22
clearing 22
chevron 22
carpenter 22
budgets 22
brussels 22
box 22
bike 22
bases 22
banned 22
bally 22
award 22
attended 22
artist 22
appointment 22
affiliates 22
adjustment 22
weakening 21
viewers 21
valuable 21
user 21
usa 21
upward 21
ultimate 21
trump 21
troops 21
treasurer 21
therefore 21
tandy 21
swedish 21
suspect 21
survive 21
suppliers 21
suburban 21
stretch 21
steve 21
stepped 21
stance 21
spinoff 21
speaker 21
spanish 21
skills 21
shortage 21
shipped 21
sending 21
secure 21
sat 21
salary 21
sacramento 21
russian 21
rumored 21
rolling 21
robust 21
roads 21
restricted 21
rent 21
renaissance 21
reliance 21
relationships 21
refinancing 21
redemption 21
raymond 21
racial 21
publishers 21
promotions 21
pointed 21
planner 21
picked 21
pemex 21
panic 21
palo 21
ounces 21
ordinary 21
notion 21
nicholas 21
newsletter 21
murder 21
mission 21
ministers 21
mercury 21
lotus 21
loose 21
loan-loss 21
licenses 21
kinds 21
killing 21
kemper 21
katz 21
jurors 21
jacobson 21
installed 21
injunction 21
ingersoll 21
indications 21
ill 21
hudson 21
honda 21
happening 21
goodson 21
generated 21
fuji 21
foster 21
formally 21
forcing 21
financed 21
fidelity 21
feb. 21
fare 21
extension 21
expecting 21
exchequer 21
equities 21
emerge 21
eliminating 21
eligible 21
dumped 21
driven 21
dozens 21
discontinued 21
deficit-reduction 21
craig 21
counts 21
count 21
convinced 21
conversion 21
contain 21
components 21
completion 21
compiled 21
competitor 21
coalition 21
cleanup 21
charity 21
cfcs 21
cent 21
born 21
bias 21
berkeley 21
bearish 21
bates 21
baskets 21
basically 21
aviation 21
attacks 21
apartment 21
anyway 21
angry 21
amoco 21
agrees 21
aftermath 21
affecting 21
advisory 21
a.m 21
30-day 21
wisconsin 20
wheat 20
wedtech 20
warsaw 20
ward 20
vulnerable 20
utah 20
unusually 20
tva 20
truth 20
treat 20
treasurys 20
tourists 20
tourist 20
teacher 20
sullivan 20
strategist 20
stolen 20
staffers 20
sounds 20
somewhere 20
small-business 20
similarly 20
shelf 20
setback 20
serving 20
semel 20
seller 20
sansui 20
rowe 20
rolled 20
rice 20
responsibilities 20
resorts 20
requests 20
repeatedly 20
rely 20
rejection 20
regarded 20
refund 20
referred 20
recognized 20
reaching 20
publication 20
promoting 20
pro-choice 20
print 20
preparing 20
prepare 20
pioneer 20
petrochemical 20
owning 20
optical 20
nine-month 20
nigel 20
netherlands 20
nabisco 20
museum 20
motorola 20
mississippi 20
minute 20
mgm\/ua 20
meaning 20
maturing 20
marketers 20
lucrative 20
lowest 20
louisville 20
liabilities 20
lend 20
lake 20
knight 20
judgment 20
jackson 20
iron 20
investigators 20
informed 20
incest 20
immune 20
ice 20
horse 20
honor 20
homeless 20
healthcare 20
grounds 20
golf 20
globe 20
geneva 20
gaf 20
fusion 20
formula 20
facts 20
explained 20
expenditures 20
execution 20
environmentalists 20
entry 20
encouraging 20
enable 20
empire 20
elderly 20
efficiency 20
edwards 20
dorrance 20
dominant 20
distributor 20
disney 20
discrimination 20
die 20
darman 20
danger 20
cumulative 20
creation 20
cowboys 20
contest 20
consortium 20
connaught 20
congressman 20
concessions 20
conceded 20
compare 20
communities 20
claiming 20
carefully 20
calculations 20
bullish 20
borrow 20
bonuses 20
bass 20
averaged 20
assist 20
articles 20
arguments 20
announcing 20
animals 20
alex 20
aim 20
agricultural 20
absolutely 20
ab 20
500-stock 20
windows 19
visited 19
visible 19
violated 19
victim 19
useful 19
upset 19
upham 19
unsuccessful 19
unprecedented 19
unclear 19
truly 19
tracks 19
tony 19
thousand 19
tele-communications 19
tanks 19
talked 19
surface 19
surely 19
superior 19
strongest 19
striking 19
strikes 19
storm 19
stamford 19
spin 19
speak 19
song 19
solidarity 19
silicon 19
shipyard 19
sentence 19
seagram 19
rubicam 19
routine 19
routes 19
richmond 19
reverse 19
revco 19
restored 19
responding 19
reporter 19
removed 19
refining 19
recognize 19
reacted 19
rarely 19
psychology 19
protests 19
prominent 19
procter 19
pregnant 19
posting 19
periods 19
passenger 19
ozone 19
oppenheimer 19
operated 19
offsetting 19
notice 19
notably 19
nice 19
nicaraguan 19
nelson 19
mood 19
momentum 19
microsoft 19
merkur 19
merieux 19
meredith 19
mention 19
mason 19
maidenform 19
lunch 19
lorenzo 19
lockheed 19
lifted 19
ldp 19
landing 19
l.j. 19
kansas 19
jail 19
involves 19
intervention 19
improving 19
ignoring 19
ignore 19
i. 19
hotels 19
highs 19
heating 19
hdtv 19
harry 19
halted 19
gerald 19
gardens 19
frederick 19
franchisees 19
fireman 19
fha 19
featuring 19
feared 19
exposed 19
explanation 19
explaining 19
examination 19
engines 19
engineered 19
employs 19
employer 19
emotional 19
dream 19
deloitte 19
definition 19
deciding 19
cool 19
contribute 19
contra 19
conflict 19
computing 19
comptroller 19
compound 19
comedy 19
columns 19
colony 19
coleman 19
clothing 19
challenges 19
categories 19
campaigns 19
buys 19
buick 19
brother 19
brooklyn 19
broadly 19
bright 19
bonus 19
beverly 19
benefited 19
bench 19
basketball 19
avery 19
arrived 19
arranged 19
application 19
anywhere 19
anthony 19
animal 19
ambitious 19
alto 19
albert 19
advances 19
adults 19
adopt 19
achieve 19
achenbaum 19
accommodate 19
absence 19
yielding 18
yes 18
year-end 18
withdraw 18
welcome 18
wealth 18
wathen 18
wary 18
vision 18
violate 18
v. 18
upscale 18
upper 18
universal 18
underwriting 18
transition 18
tourism 18
touch 18
tokyu 18
tickets 18
throw 18
thanks 18
textile 18
targeted 18
surgery 18
supercomputer 18
summit 18
suggestions 18
suffering 18
successfully 18
submit 18
studied 18
string 18
strengthen 18
stemming 18
steadily 18
squeezed 18
skeptical 18
sizable 18
sixth 18
shore 18
shield 18
shared 18
select 18
sdi 18
satisfaction 18
rouge 18
reynolds 18
restrict 18
restated 18
researcher 18
repeal 18
repay 18
regulator 18
reebok 18
rebounded 18
realty 18
reaches 18
ranks 18
pursuing 18
pull 18
protest 18
properly 18
proper 18
presidency 18
predicts 18
physical 18
pc 18
patient 18
participating 18
parking 18
packwood 18
opposite 18
olivetti 18
objectives 18
nestle 18
narrowed 18
mortality 18
morishita 18
moral 18
mitsui 18
milan 18
method 18
merchants 18
meantime 18
mcdonough 18
maturities 18
mather 18
matched 18
maintaining 18
maine 18
lobbying 18
liquor 18
liquid 18
links 18
levine 18
lately 18
kingdom 18
kentucky 18
kemp 18
keating 18
kabul 18
jewelry 18
jerry 18
itt 18
investigations 18
interviewed 18
incurred 18
impeachment 18
ignored 18
idle 18
hitachi 18
high-tech 18
high-grade 18
herald 18
hbo 18
harold 18
guilders 18
granted 18
gramm-rudman 18
gen-probe 18
garcia 18
finland 18
financial-services 18
films 18
fend 18
female 18
favored 18
fault 18
executed 18
exact 18
eurocom 18
establishment 18
equally 18
employed 18
emerged 18
dun 18
drove 18
drivers 18
drawn 18
drabinsky 18
dpc 18
don 18
dole 18
displays 18
discounts 18
diego 18
desert 18
denies 18
delicious 18
defined 18
deeply 18
debut 18
cyclical 18
creditor 18
crane 18
crack 18
covert 18
contribution 18
connected 18
confusion 18
conducting 18
commodore 18
climb 18
clause 18
cigarette 18
chevrolet 18
carlos 18
c 18
bradstreet 18
bork 18
bondholders 18
blocks 18
benson 18
belief 18
band 18
balloon 18
backlog 18
arrest 18
aluminum 18
ally 18
agenda 18
afraid 18
advancing 18
adjusters 18
actively 18
1960s 18
100-share 18
wrongdoing 17
writers 17
witness 17
wire 17
winners 17
wider 17
wear 17
volokh 17
violence 17
vaccine 17
urge 17
understanding 17
unconstitutional 17
tries 17
tremendous 17
toy 17
tougher 17
topic 17
threatening 17
tendered 17
teddy 17
tax-exempt 17
suggesting 17
stuck 17
strict 17
stockholm 17
stemmed 17
steinberg 17
stages 17
spirit 17
speculated 17
sparked 17
southwest 17
southeast 17
societe 17
soaring 17
smoke 17
slashed 17
singer 17
signing 17
shuttle 17
shock 17
shevardnadze 17
settlements 17
serves 17
seize 17
sanford 17
salespeople 17
salaries 17
rosen 17
respect 17
remainder 17
reject 17
registration 17
regions 17
regardless 17
refuse 17
redeem 17
recommendations 17
rain 17
quit 17
qualify 17
pursuit 17
publicity 17
prudential 17
protesters 17
promotional 17
proceed 17
privatization 17
private-sector 17
popularity 17
picking 17
phase 17
perception 17
payroll 17
passengers 17
overcome 17
oregon 17
odd 17
ocean 17
occasionally 17
obligations 17
nl 17
negotiate 17
nato 17
nashua 17
n.j 17
movements 17
montreal 17
minpeco 17
miniscribe 17
mid-october 17
mexican 17
mere 17
married 17
magnetic 17
madison 17
losers 17
libor 17
letting 17
legitimate 17
leasing 17
