<S> 98398
aer 11
banknote 12
berlitz 8
calloway 7
centrust 46
cluett 7
fromstein 10
gitano 7
guterman 7
hydro-quebec 9
ipo 8
kia 8
memotec 12
mlx 7
nahb 11
punts 10
rake 10
regatta 7
rubens 14
sim 12
snack-food 7
ssangyong 7
swapo 7
wachter 8
pierre 6
<UNK> 53299
N 37607
years 1426
old 308
will 3766
join 52
the 59421
board 724
as 5696
a 24755
nonexecutive 6
director 411
nov. 276
mr. 4949
is 8533
chairman 736
of 28427
n.v. 16
dutch 34
publishing 74
group 1101
rudolph 9
and 20404
former 348
consolidated 42
gold 183
fields 47
plc 133
was 4900
named 237
this 2851
british 403
industrial 292
conglomerate 25
form 125
asbestos 32
once 249
used 425
to 27430
make 739
kent 12
cigarette 21
filters 11
has 4040
caused 138
high 468
percentage 163
cancer 111
deaths 32
among 523
workers 283
exposed 19
it 7191
more 2423
than 2035
ago 565
researchers 88
reported 499
fiber 8
unusually 22
enters 9
with 5354
even 904
brief 43
exposures 7
causing 40
symptoms 14
that 10419
show 278
up 2094
decades 32
later 261
said 7141
inc. 1355
unit 635
new 3251
york-based 44
corp. 1543
makes 211
cigarettes 23
stopped 64
using 174
in 21032
its 4570
although 329
preliminary 56
findings 27
were 2414
year 2753
latest 278
results 360
appear 96
today 401
's 11555
england 76
journal 133
medicine 34
forum 7
likely 325
bring 108
attention 83
problem 279
an 3994
story 85
we 1657
're 427
talking 65
about 2668
before 713
anyone 81
heard 45
having 169
any 987
questionable 12
properties 91
there 1257
no 1003
our 472
products 557
now 1031
neither 81
nor 88
who 1928
studied 21
aware 37
research 359
on 6643
smokers 7
have 3786
useful 22
information 238
whether 335
users 45
are 4527
at 5767
risk 187
james 226
a. 129
boston 195
institute 165
dr. 115
led 196
team 156
from 5435
national 691
medical 151
schools 64
harvard 30
university 207
spokeswoman 115
very 461
modest 89
amounts 89
making 286
paper 279
for 10436
early 446
1950s 14
replaced 37
different 166
type 53
billion 2154
sold 478
company 3077
men 127
worked 93
closely 121
substance 16
died 49
three 774
times 294
expected 665
number 386
four 356
five 439
surviving 10
diseases 19
including 520
recently 325
total 348
malignant 8
lung 21
far 405
higher 523
rate 653
striking 23
finding 56
those 711
us 251
study 134
west 340
mass. 68
factory 52
appears 91
be 4586
highest 73
western 186
industrialized 13
countries 180
he 4217
plant 303
which 2756
owned 122
by 5705
& 1279
co. 1130
under 841
contract 385
probably 182
support 288
argue 56
u.s. 2056
should 553
regulate 11
class 81
common 461
kind 131
found 221
most 1146
other 1806
buildings 67
one 2048
few 448
nations 72
does 612
n't 4006
standard 179
regulation 36
smooth 13
fibers 14
such 1161
classified 11
according 497
t. 58
professor 58
vermont 15
college 80
easily 50
rejected 87
body 35
explained 23
july 229
environmental 116
protection 127
agency 386
imposed 30
gradual 9
ban 61
virtually 62
all 1463
uses 65
almost 251
remaining 91
outlawed 8
made 655
areas 141
particularly 161
dusty 6
where 460
dumped 26
large 313
imported 33
material 64
into 1120
huge 164
poured 9
cotton 30
mixed 63
dry 17
process 154
described 50
clouds 8
blue 63
dust 9
hung 8
over 1105
parts 131
though 368
fans 35
area 254
question 157
some 1941
managers 224
contracted 13
phillips 57
vice 485
president 1430
human 92
resources 119
but 4192
you 937
recognize 22
these 700
events 87
took 271
place 208
bearing 13
work 481
force 244
yields 127
money-market 23
mutual 97
funds 549
continued 213
slide 63
amid 72
signs 76
portfolio 187
expect 241
further 321
declines 104
interest 768
rates 589
average 562
seven-day 15
compound 24
yield 432
taxable 25
tracked 12
money 693
fund 399
report 474
eased 33
fraction 12
point 346
week 838
ended 385
tuesday 235
assume 46
reinvestment 15
dividends 89
current 410
continues 116
maturity 72
' 767
investments 171
day 458
days 617
longest 7
since 710
august 318
donoghue 7
longer 140
maturities 19
thought 139
indicate 49
declining 79
because 1353
they 2962
permit 30
retain 41
relatively 97
period 360
shorter 8
considered 138
sign 104
rising 113
can 1143
capture 10
sooner 18
open 197
only 1188
institutions 157
stronger 65
indicator 23
watch 48
market 2647
reached 183
nevertheless 45
editor 69
may 1109
again 232
down 939
recent 569
rises 19
short-term 128
six-month 52
treasury 420
bills 202
monday 333
auction 132
example 268
rose 829
despite 258
investors 947
continue 317
pour 10
cash 439
assets 401
grew 83
$ 8764
during 556
typically 82
money-fund 6
beat 36
comparable 58
vary 31
go 327
after 1362
top 242
currently 253
yielding 20
well 553
dreyfus 12
world-wide 82
dollar 372
had 2217
earlier 727
invests 6
heavily 80
dollar-denominated 8
securities 843
overseas 117
management 434
fees 158
boosts 16
simple 47
30-day 23
fell 538
slid 41
j.p. 16
grace 27
holds 100
elected 88
succeeds 52
d. 187
formerly 43
resigned 97
energy 174
seven 149
seats 60
pacific 177
first 1382
financial 747
shareholders 212
approved 170
acquisition 266
royal 38
ltd. 229
toronto 55
share 1798
or 3169
million 5331
thrift 141
holding 255
expects 317
obtain 52
regulatory 89
approval 172
complete 80
transaction 219
year-end 22
international 544
completed 157
sale 483
controls 76
operations 472
s.p 14
italian 34
state-owned 28
interests 159
mechanical 9
engineering 81
industry 707
based 403
ohio 78
computerized 18
systems 298
employs 21
people 907
annual 325
revenue 567
federal 1021
government 1002
suspended 60
sales 1331
savings 179
bonds 803
congress 389
lifted 20
ceiling 49
debt 528
until 391
acts 32
authority 105
issue 536
obligations 23
borrowing 39
dropped 246
midnight 16
trillion 59
legislation 161
lift 27
fight 89
cutting 59
capital-gains 93
taxes 125
house 612
voted 60
raise 195
senate 280
act 162
next 778
earliest 9
default 44
if 1480
then 526
clark 18
j. 140
senior 289
general 560
manager 215
marketing 211
arm 36
japanese 566
auto 199
maker 352
mazda 14
motor 128
corp 219
position 230
oversee 8
service 409
previously 183
chrysler 56
division 224
been 1968
executive 707
when 1511
time 1031
their 2143
nation 256
manufacturing 163
jet 23
off 669
resort 31
towns 12
like 653
hot 46
springs 17
not 1699
association 289
manufacturers 130
settled 72
capital 580
indianapolis 16
fall 223
meeting 259
city 381
decided 109
treat 21
guests 12
royalty 10
rock 35
stars 14
owners 88
idea 102
course 152
prove 56
corporate 341
decision 235
makers 188
buckle 6
belt 10
so 990
good 453
expand 71
receiving 28
end 464
message 40
officials 667
giants 55
du 38
pont 35
along 182
lesser 13
steel 243
valley 99
queen 8
executives 266
joined 57
mayor 60
william 162
h. 56
iii 30
evening 35
guest 9
victor 19
champagne 7
followed 111
morning 121
police 78
wives 9
traffic 61
red 117
lights 14
governor 36
could 1335
welcomed 13
special 187
buffet 5
breakfast 11
held 293
museum 20
food 199
drinks 10
banned 23
everyday 9
visitors 28
honor 21
out 1265
drivers 18
crews 9
official 267
announcer 12
exhibition 12
race 39
fortune 11
cars 172
pointed 29
still 742
space 131
machines 173
another 535
sponsor 18
name 157
two 1378
back 573
downtown 26
squeezed 19
meetings 53
hotel 68
buses 12
dinner 18
block 117
away 213
indiana 14
nine 253
hottest 11
chefs 8
town 67
fed 219
them 803
knowing 12
free 171
eat 17
gave 107
standing 38
say 878
treatment 80
return 245
future 245
looking 178
forward 35
winter 40
february 58
south 280
korea 77
registered 36
trade 525
deficit 155
october 258
reflecting 92
country 322
economic 460
figures 186
released 74
wednesday 130
ministry 95
showed 127
fifth 59
monthly 78
setback 24
casting 17
cloud 7
economy 367
exports 125
stood 33
mere 21
increase 470
while 849
imports 120
increased 321
sharply 133
last 1482
boom 42
began 261
prolonged 19
labor 180
disputes 18
conflicts 14
sluggish 38
would 2695
remain 175
target 87
gloomy 7
forecast 78
recorded 39
surplus 33
january 105
accumulated 8
same 381
newsweek 14
trying 237
keep 231
pace 74
rival 51
magazine 181
announced 290
advertising 213
introduce 38
incentive 25
plan 585
advertisers 80
ad 209
washington 258
post 115
second 359
offered 252
plans 482
give 283
discounts 24
maintaining 19
increasing 124
spending 251
become 286
permanent 39
news 422
underscore 6
fierce 10
competition 152
between 594
warner 200
b. 74
world 495
alan 67
full 197
page 28
cost 331
mid-october 17
lowered 47
guaranteed 46
circulation 50
base 130
lower 477
effectively 39
per 121
subscriber 8
costs 425
yet 307
announce 40
credit 333
credits 32
renewal 7
reward 14
bonuses 24
meet 146
exceed 39
long 344
spent 108
attempt 118
shore 18
decline 298
pages 64
months 844
totaled 89
drop 307
publishers 23
bureau 85
what 914
matters 54
paying 106
department 452
doing 142
fine 60
both 588
gaining 17
without 351
heavy 163
use 414
electronic 92
subscribers 31
telephones 13
watches 13
however 507
none 64
big 851
gains 234
audit 31
largest 287
decrease 21
six 338
flat 98
electric 137
system 418
bowed 6
bidding 78
public 413
hampshire 43
saying 172
risks 71
too 404
potential 193
justify 22
offer 539
move 359
leaves 36
united 228
illuminating 14
northeast 43
utilities 78
outside 153
bidders 30
ps 25
also 1866
proposed 257
internal 91
reorganization 78
chapter 78
bankruptcy 116
proceedings 53
independent 148
acquire 154
below 204
value 387
places 37
bid 471
says 2467
worth 127
haven 19
conn. 51
hartford 17
conn 17
n.h. 8
values 72
john 319
rowe 29
chief 709
officer 407
equity 206
suffer 32
forecasts 48
related 152
growth 460
electricity 29
demand 280
improved 97
operating 377
did 749
come 287
true 84
raising 84
seemed 67
substantial 90
persistent 16
rewards 15
way 474
got 221
hard 177
take 525
added 401
noted 174
political 296
concerns 147
worried 57
matter 106
owns 150
emerges 10
attracts 8
just 730
factors 83
withdraw 22
wilbur 9
ross 46
jr. 100
rothschild 25
adviser 61
troubled 81
holders 178
withdrawal 29
might 423
speed 60
fact 193
increases 177
against 593
around 345
complicated 24
negotiations 96
state 696
asserted 16
field 114
less 463
separately 94
commission 272
turned 142
request 67
seeking 153
possible 251
purchase 260
hopes 122
review 97
ferc 7
summer 125
court 531
shares 1443
closed 452
yesterday 868
cents 973
york 1127
stock 2002
exchange 924
composite 280
trading 1415
norman 18
toys 20
r 6
frederick 20
banking 219
directors 154
consumer 208
electronics 91
appliances 15
retailing 52
chain 106
succeed 48
daniel 39
m. 70
retired 39
circuit 65
robert 251
r. 99
undersecretary 8
commonwealth 29
edison 33
ordered 68
refund 20
illegal 49
collected 12
overruns 7
nuclear 61
power 338
illinois 39
commerce 99
groups 169
ever 163
required 126
local 226
utility 61
judge 279
richard 144
curry 10
refunds 14
each 501
customers 243
received 244
april 145
moved 101
begin 157
feb. 21
appeals 65
attempts 28
his 2119
order 243
pool 33
through 719
round 37
already 393
appealing 11
underlying 53
considering 85
exact 19
amount 239
determined 57
actual 102
dec. 124
ruling 105
slash 13
earnings 759
spokesman 411
tracking 13
whose 219
addresses 6
changed 127
past 473
administrative 46
nightmare 7
near 127
ill. 29
disputed 17
pay 444
courts 57
upheld 15
challenge 62
supreme 105
construction 190
expenses 104
collecting 13
subject 135
ruled 49
plus 77
additional 222
calculations 23
month 624
set 331
faces 64
appellate 15
estimated 265
hope 114
precedent 12
case 390
involving 69
rule 104
poor 146
performance 178
i 1472
japan 504
domestic 193
trucks 63
units 201
record 268
automobile 29
dealers 186
strong 318
year-to-year 8
september 376
setting 53
records 51
every 238
march 197
compared 335
previous 225
inched 12
passenger 24
medium-sized 12
benefited 23
price 928
reductions 29
arising 7
introduction 23
consumption 38
tax 487
doubled 39
texas 260
instruments 61
opened 128
manufacture 18
control 320
devices 62
located 25
miles 82
seoul 27
help 357
diversifying 9
produce 127
vehicles 74
household 46
survival 17
spinoff 21
cray 66
computer 489
fledgling 10
supercomputer 18
business 1169
depend 15
creativity 11
designer 20
seymour 7
development 264
initial 120
machine 111
tied 46
directly 114
balance 71
sheet 31
documents 62
filed 232
pending 74
disclosed 150
financing 227
providing 56
firm 577
project 155
heads 45
scrapped 10
working 187
cray-3 10
least 392
fully 110
operational 22
prototype 6
moreover 103
orders 272
several 476
prospects 56
many 1089
anticipated 44
attached 30
much 863
choice 52
gregory 9
interview 98
theory 41
him 396
want 345
include 240
anticipates 16
perhaps 142
beginning 141
called 361
scenario 31
filing 121
details 83
jump 58
close 408
analysts 655
link 31
note 122
presence 47
complicate 6
valuation 10
investor 246
gary 31
p. 32
minneapolis 32
concept 39
either 177
believe 202
do 1190
besides 39
age 107
tricky 8
chip 49
technology 255
sec 107
describe 12
chips 73
being 508
fragile 13
minute 22
require 109
handling 41
equipment 232
addition 258
contain 24
processors 15
twice 59
face 195
intense 36
roll 42
direct 99
competitor 24
compete 38
hitachi 18
nec 37
fujitsu 36
ltd 76
believes 109
fewer 65
priced 265
presumably 9
range 141
terms 240
stockholders 24
receive 125
own 551
distribution 61
occur 33
weeks 293
instead 209
companies 1020
leave 98
marketplace 35
decide 65
applied 54
nasdaq 91
calculate 6
book 92
primarily 73
drain 16
sheets 18
clearly 81
why 170
favored 18
able 220
profit 606
half 327
rather 207
posted 201
hand 119
existed 10
incurred 23
loss 465
comment 261
colorado 25
colo. 14
contractor 29
arrangement 37
regarded 21
father 48
paid 266
messrs. 40
includes 152
neil 13
joseph 56
malcolm 30
software 125
douglas 46
hardware 27
came 243
stevens 30
positions 94
donald 52
arthur 36
hatch 8
eastern 160
claiming 23
success 89
removed 21
taiwan 34
saudi 25
arabia 15
list 85
watching 41
allegedly 27
failing 26
patents 19
rights 227
china 210
thailand 9
india 44
brazil 39
mexico 85
so-called 86
priority 37
result 296
interim 20
representative 34
carla 7
hills 62
law 394
accelerated 11
investigations 18
stiff 15
sanctions 27
improve 99
intellectual 16
property 139
spring 100
mrs. 181
she 638
placed 73
degrees 11
scrutiny 15
genuine 17
progress 46
touchy 6
growing 164
citizens 46
negotiators 18
inadequate 16
hurting 14
themselves 149
discouraging 13
scientists 72
authors 16
high-technology 10
firms 346
investing 50
best 209
creating 47
task 59
enforcement 38
teams 31
officers 37
prosecutors 64
trained 10
pursue 52
movie 74
instituted 11
effective 107
procedures 38
aid 128
copyright 17
agreement 397
trademark 8
introducing 15
protect 65
foreign 448
producers 153
unauthorized 11
films 22
measure 142
taipei 15
small 405
showing 68
part 530
vowed 19
enact 10
compatible 8
standards 93
apply 39
literary 10
works 90
completely 29
hook 8
italy 63
canada 191
greece 25
spain 48
concern 412
deemed 10
pose 9
problems 344
american 731
patent 61
hoffman 17
lawyer 87
specializing 11
cases 172
threat 69
combined 80
recognition 31
protecting 15
prompted 45
improvements 31
tells 28
efforts 171
craft 8
concerned 78
disturbing 9
developments 37
turkey 23
continuing 127
slow 98
malaysia 29
elaborate 41
reports 181
complained 41
videocassette 8
pharmaceutical 57
requires 47
bad 150
enough 228
merit 15
investigation 92
provision 105
argentina 11
ask 63
creditor 23
banks 461
developing 70
declaration 12
minister 120
believed 79
action 212
latin 33
little 379
reach 90
reduction 83
external 14
met 95
assistant 65
secretary 185
david 182
mulford 11
negotiator 7
carlos 18
office 418
feels 21
significant 140
principal 75
solved 11
wants 154
centennial 18
wall 380
street 403
century 64
stand 84
milestones 13
history 130
computers 216
personal 195
computing 20
launched 69
apple 84
ii 60
commodore 18
pet 14
tandy 23
crude 80
television 175
sets 46
screens 23
data 259
major 781
advance 67
built 110
garage 6
stephen 64
steven 31
jobs 104
club 52
affordable 6
pcs 18
triggered 52
explosive 7
product 256
desktop 16
models 61
home 373
mainframe 33
unlike 74
types 46
store 86
memories 29
faster 49
memory 41
capacity 118
greater 99
counterparts 19
pioneer 20
pc 19
gates 17
paul 133
allen 34
developed 96
became 129
billionaire 10
ibm 190
adapted 12
versions 30
f. 54
seagate 9
disk 42
drives 54
dennis 28
dale 10
atlanta 45
engineers 37
allow 139
via 201
telephone 169
leader 147
entered 54
shipments 51
annually 64
australian 62
pharmaceuticals 27
affiliate 43
acquired 163
sells 72
label 16
voting 52
stake 366
together 111
convertible 119
preferred 125
holdings 154
gives 80
right 325
oil 425
production 338
australia 92
bass 23
raised 165
barrels 63
launch 53
scheduled 146
brought 109
esso 6
exxon 62
broken 39
hill 62
operate 63
joint 167
venture 170
started 151
output 84
gradually 18
reaches 18
reserves 147
start 152
producing 64
southern 97
optical 20
subsidiary 190
thomas 87
sloan 12
following 224
buy-out 222
shearson 146
lehman 107
hutton 96
itself 189
certain 280
businesses 267
program 665
white 285
bush 427
duty-free 10
produced 120
quantities 18
virgin 8
islands 15
response 108
petition 12
changes 234
preferences 10
denied 54
requested 29
covered 50
tariff 13
grant 30
status 42
categories 21
injury 13
producer 93
seller 23
assembled 13
philippines 26
main 116
beneficiaries 17
eligible 21
aide 38
magna 8
mcalpine 8
frank 74
stepping 13
turn 152
manufacturer 50
effort 180
reduce 175
overhead 16
curb 28
satisfactory 8
level 264
achieved 36
maintained 27
finance 221
ambitious 25
expansion 81
left 192
excess 57
load 28
automotive 65
downturn 40
steady 43
cut 324
quarterly 105
dividend 175
52-week 11
canadian 185
dollars 209
us$ 76
c$ 83
founder 43
controlling 28
shareholder 113
seek 119
unsuccessfully 9
seat 39
parliament 38
resume 47
influential 17
role 152
running 110
throughout 69
organization 99
personally 17
restructuring 185
consulting 67
career 44
clients 164
lord 12
english 39
chemical 170
nearly 275
bought 185
mortgage 219
totaling 37
purchases 89
fannie 52
mae 68
o. 15
maxwell 41
conference 142
institutional 106
rest 116
went 168
france 135
hong 171
kong 162
snapped 15
similar 186
mortgage-backed 27
put 361
blackstone 8
investment 716
bank 955
jointly 48
goldman 84
sachs 74
daiwa 33
co 220
seven-year 11
offering 345
fixed-rate 29
floating-rate 8
linked 34
london 306
interbank 32
key 142
advantages 14
designed 111
eliminate 41
prepayment 7
forces 99
channel 40
payments 170
semiannual 9
reducing 46
burden 30
addressing 10
extremely 55
attractive 43
boosted 58
outstanding 222
rapid 42
purchasers 11
buying 354
issued 144
l. 71
expanding 47
members 270
ltv 35
agreed 357
extend 47
aerospace 67
exclusive 36
file 54
code 44
giving 83
creditors 117
lawsuits 46
debts 28
giant 124
montedison 13
indirect 11
tender 80
erbamont 11
incorporated 10
netherlands 24
advertised 6
editions 13
expire 35
november 91
currencies 40
drawing 21
hefty 28
marks 158
sixth 20
consecutive 51
reflects 62
intensity 10
intervention 19
june 210
currency 143
temporarily 48
surged 66
above 197
yen 395
announcement 120
follows 62
sharper 8
pick 49
craze 6
sweeping 27
rash 9
closed-end 11
publicly 81
traded 136
portfolios 43
invest 56
stocks 800
single 104
regulators 142
triple 10
charles 95
e. 81
simon 14
washington-based 7
turf 10
ranged 17
chile 7
portugal 8
philippine 15
capped 33
visit 52
aquino 8
head 200
kicked 18
here 351
province 18
anything 131
how 452
guinea 9
george 127
foot 31
managing 91
partner 123
associates 117
mass 41
explosion 18
mania 6
1920s 8
narrowly 13
focused 28
wildly 10
popular 91
crash 183
traditional 83
issuing 17
fixed 74
surge 52
brings 17
soon 202
listed 71
account 197
billions 41
claims 197
available 181
runs 77
michael 154
porter 7
analyst 345
smith 115
barney 35
harris 40
upham 26
behind 111
individual 181
scrambled 13
find 181
brokers 134
easy 78
sell 603
stretching 8
wide 63
planners 36
often 235
urge 18
diversify 8
hold 149
emerging 28
markets 621
mature 33
get 572
taste 16
burned 12
gyrations 30
prices 1016
tend 53
swing 15
broader 37
oct. 389
instance 111
plunged 77
clobbered 7
wild 35
frenzy 14
historically 17
fat 24
premiums 33
discount 105
late 405
premium 96
reason 150
climbed 92
partially 11
specialists 61
european 222
skyrocketed 6
startling 7
targeted 24
long-term 187
play 108
integration 18
invested 47
jumped 128
'm 149
alarmed 8
see 357
rich 50
newly 52
reflect 63
increasingly 81
global 73
suggests 56
asia 53
europe 238
exposure 43
viewpoint 7
cast 38
nonetheless 29
plenty 34
levels 165
buy 595
depositary 20
receipts 29
adrs 7
represent 60
essentially 37
insist 41
jumping 8
advice 44
folks 14
party 180
better 265
ready 73
quickly 142
soviet 301
union 385
technical 79
talks 191
repayment 10
moscow 76
russian 23
owed 31
repaid 13
clear 163
soviets 76
happen 60
permitted 30
branch 51
affairs 62
unless 101
settle 57
lent 10
short-lived 7
democratic 125
communists 17
seized 17
johnson 88
amended 20
americans 111
monetary 77
u.s.s.r. 12
belongs 10
stressed 16
satisfying 6
legal 193
obstacles 13
hundreds 65
millions 48
war 130
reflection 9
manufactured 17
goods 148
failed 157
rise 257
meanwhile 196
purchasing 54
survey 103
indicated 97
index 545
reading 42
sector 113
generally 148
factories 30
booked 7
defense 236
contractors 24
fallen 56
separate 109
ran 44
significantly 63
private 226
building 251
activity 158
adjusted 67
remove 32
effects 68
usual 68
seasonal 26
patterns 16
inflation 201
kenneth 28
economist 107
society 74
cleveland 35
revive 31
residential 30
slack 10
asked 203
draw 35
blank 10
measures 88
slowly 23
reserve 181
economists 108
predicting 28
slip 17
recession 123
cite 14
lack 84
imbalances 15
provide 219
warning 42
signals 21
inventories 47
watched 33
clues 8
buildup 10
cutbacks 13
lead 164
front 59
soft 45
landing 23
elliott 6
donaldson 38
lufkin 32
jenrette 28
excessive 25
slowdown 65
leading 159
intended 58
climbing 14
durable 25
backlogs 7
unfilled 6
helped 167
strength 86
excluding 48
declined 304
accounts 139
bankers 140
predicted 67
eventually 84
boost 123
single-family 9
homes 74
adjusting 9
change 288
contrast 60
mcgraw-hill 15
dodge 15
contracts 209
awarded 44
counts 22
slowing 68
imminent 17
committee 315
materials 88
pitney 8
bowes 8
stamford 20
low 205
evidence 117
export 82
purchased 72
vendors 6
delivering 11
consider 138
pressures 35
suppliers 26
handle 52
delivery 128
provided 94
indicators 35
difference 76
reporting 55
improvement 76
particular 79
worsening 10
polled 11
import 46
acknowledging 6
trend 81
suspect 23
going 385
items 77
short 170
supply 134
numbered 6
dozen 62
included 193
milk 29
odd 17
thing 159
row 26
shortage 23
blamed 35
dairy 7
exceptionally 8
coupled 11
quotas 27
contributed 104
article 119
seasonally 28
judging 8
sheep 7
chase 53
baby 28
boomers 11
sides 64
lot 228
novel 31
entirely 36
especially 165
characters 26
drink 18
dogs 15
bugs 17
bunny 6
reruns 8
read 89
talk 101
worry 56
careers 12
reader 19
engaging 9
recognizing 8
contemporary 13
author 32
belong 12
school 176
writers 18
notion 26
unique 12
outsiders 12
carries 41
implicit 7
relations 72
think 391
plot 15
rooted 6
reality 27
funny 17
hero 10
snow 7
search 32
star 58
stanford 10
degree 28
girlfriend 7
sassy 12
mark 111
her 511
meets 11
christian 17
offers 107
god 16
phone 88
man 145
sweet 13
figure 102
wears 9
else 94
40-year-old 7
norwegian 7
wood 28
seems 151
copies 29
published 41
tokyo 213
pack 12
charts 8
books 61
written 56
language 56
usually 123
carry 80
macmillan 19
baseball 61
version 89
call 169
game 121
describes 16
mirror 13
harmony 6
spirit 21
player 40
commitment 44
practice 84
image 84
important 210
polls 28
soul 6
male 22
symbol 29
played 62
ball 23
bat 6
balls 6
stadium 31
strike 119
zone 7
depending 29
size 116
ties 51
shame 7
defeat 17
players 78
must 294
strict 18
rules 156
conduct 35
lives 50
always 142
wear 22
road 49
amusing 8
fare 23
enormous 44
sums 11
plate 15
run 213
complaint 24
whom 70
sony 147
regret 10
parties 75
sometimes 89
vicious 7
mundane 7
aspects 26
employees 274
assigned 18
lunch 25
partners 133
style 53
overtime 14
solidarity 19
letting 20
young 148
employee 75
responsibility 50
frustrating 7
science 34
ultimately 48
lesson 21
fired 29
committed 45
social 86
crime 71
appointment 25
venerable 7
never 229
certainly 84
learned 46
something 161
ms. 254
deputy 61
editorial 44
features 36
corners 10
globe 24
becoming 43
tobacco 42
smoke 17
singapore 50
entering 18
restaurants 36
stores 193
sports 96
centers 76
clubs 16
exempt 14
smoking 27
bars 12
except 69
hours 151
bans 9
theaters 8
elevators 9
hospitals 29
fast-food 43
prime 131
kuala 9
lumpur 9
urged 47
visiting 12
restricts 6
designated 13
indicates 40
consumers 116
carried 48
backer 21
spielvogel 33
bates 23
colony 22
feel 118
pressured 13
surveyed 26
identified 39
one-third 40
great 223
deal 262
stress 30
cabinet 17
endorsed 16
proposal 249
build 153
center 173
central 149
plaza 10
balked 9
conditions 120
undertaking 8
necessary 84
arafat 13
olympic 6
asking 56
palestinian 14
liberation 8
membership 51
renewed 37
application 23
plo 14
organizations 40
win 94
health 251
tourism 21
beijing 53
chinese 70
aids 45
sex 31
daily 145
disease 29
hospital 58
tests 66
confirmed 56
family 198
tested 19
newspaper 104
chaotic 7
life 299
polish 29
charges 199
gas 237
line 284
compensate 12
coal 42
establishing 18
diplomatic 13
poland 93
loans 343
financially 36
strapped 10
warsaw 26
victory 38
environmentalists 20
hungary 45
terminated 15
multibillion-dollar 7
river 51
dam 9
czechoslovakia 12
ending 74
authorized 32
modify 6
damage 230
planned 134
ca 230
operated 20
solely 16
peak 33
periods 26
painting 22
stockholm 18
painted 14
oils 11
playwright 8
couples 18
statistics 58
debentures 86
due 408
bond 416
warrants 64
toronto-based 17
real 388
estate 267
warrant 29
holder 33
par 96
accrued 15
date 99
underwriters 64
dominion 8
actor 18
lane 25
charlie 9
steve 28
martin 44
laid 16
claim 76
writer 38
tramp 6
film 90
student 47
campus 8
shot 46
black-and-white 26
artist 28
streets 28
revived 15
sidewalk 7
stories 45
piece 57
contained 23
dialogue 17
homeless 20
person 78
really 159
silent 8
marc 8
friend 45
earns 11
living 58
playing 45
double 64
classical 6
music 61
prepared 82
exciting 12
score 16
thinking 32
feeling 35
precisely 12
words 69
takes 97
highly 102
view 158
lovely 8
black 210
bill 449
seem 124
benign 7
women 125
walk 24
purpose 38
hangs 6
greenwich 17
village 11
strip 33
avenue 33
crack 20
selling 353
four-year-old 7
box 24
routine 20
spends 15
night 136
returns 118
calls 189
competing 35
given 177
blind 7
girl 12
cure 10
charge 232
returning 16
murdered 8
mother 49
child 46
turns 42
blessing 9
sense 109
serious 108
mission 28
stakes 30
woman 99
children 119
shop 39
expensive 79
apartment 25
strongly 42
camera 17
final 115
existence 16
ends 32
sound 56
rough 18
beaten 8
voices 15
french 140
managed 66
weird 7
achievement 12
harsh 11
brilliant 7
picture 51
character 28
viewed 40
sympathetic 12
historical 19
significance 11
executed 21
germans 32
thousands 72
resistance 44
needed 140
enabled 9
cocoa 22
job 159
killed 36
client 67
husband 37
openly 15
presented 32
nice 23
deserve 11
recommend 17
confused 9
mexican 24
revolution 25
taken 196
endless 8
scenes 13
fighting 41
eating 14
drinking 16
mention 24
movies 56
bright 21
spot 53
peck 15
loose 24
energetic 8
portrayal 8
die 23
video 42
tip 11
seeing 42
look 198
boeing 79
discussing 33
regular 54
possibly 46
larger 90
discussions 56
stages 18
specific 99
seattle 19
industries 220
mitsubishi 63
fuji 21
sections 10
accounting 83
aircraft 94
press 141
speculated 18
contribution 22
goes 90
ahead 140
plane 27
hit 171
mid-1990s 12
negative 87
secondary 42
campaigns 21
event 60
irony 8
attack 47
commercial 272
getting 201
presidential 28
campaign 148
election 68
scattered 8
across 111
ads 93
fears 64
empty 14
issues 457
era 28
content 14
politics 52
art 91
stage 49
consultant 83
your 254
tv 185
needs 102
bold 13
entertaining 7
means 149
fights 7
commercials 19
tone 29
elections 69
jersey 64
virginia 38
screen 33
tight 35
dinkins 90
candidate 32
income 574
straight 28
voice 57
republican 78
giuliani 30
roger 31
master 28
gets 77
contributions 42
accurately 9
links 22
insurance 430
convicted 33
phony 8
wait 45
caught 49
nasty 10
corruption 17
simply 129
exist 29
consultants 53
finally 83
shows 136
distorted 8
photos 15
politicians 47
compare 22
candidates 56
banning 18
bullets 6
opposed 62
pro-choice 20
choose 30
telling 32
truth 21
everybody 46
nobody 50
classic 29
situation 133
accurate 13
fail 27
insists 27
voluntarily 13
admitted 25
oversight 15
secret 32
refused 55
matching 22
incomplete 9
errors 15
know 254
peter 110
powers 30
deceptive 9
side 127
argues 31
knows 49
reservations 11
gov. 29
wilder 11
gubernatorial 7
battle 107
marshall 44
coleman 19
abortion 133
agree 69
tour 12
de 136
flag 26
tradition 20
freedom 42
liberty 12
generations 11
jefferson 8
wanted 119
rape 32
incest 22
denies 21
dynamics 29
attorney 161
series 286
advertisements 9
created 128
bob 40
goodman 8
shake 19
attracted 28
featured 14
suggested 62
courtroom 13
introduced 112
victims 72
younger 31
lawyers 172
accused 61
tried 77
pass 51
legislative 37
technique 29
lawmakers 86
grown 48
tired 8
gotten 27
scientist 16
mary 32
devote 8
remainder 19
season 76
positive 63
truce 8
lasted 10
stations 65
carrying 37
featuring 22
himself 109
questions 109
attacks 21
rep. 141
florio 22
aired 11
photograph 7
jim 33
courter 26
remember 27
female 20
mean 80
pictures 51
focus 97
hazardous 8
waste 36
neighbors 14
suing 7
fraud 70
nose 12
grows 19
involved 143
cry 9
responded 33
photographs 8
lying 13
asks 24
barrel 29
land 101
heating 19
pollution 30
environment 72
devastating 14
credibility 36
route 13
re-election 11
rout 18
democrat 34
gop 40
nelson 23
rockefeller 33
appeared 64
chicago 290
friday 668
quoted 102
aug. 61
southeast 25
region 73
toward 154
interviews 18
suggest 59
cooperation 46
asian 35
pursued 13
fits 14
starts 34
domination 6
fresh 40
policy 307
flow 68
motion 24
economies 27
tripled 12
commitments 58
steep 36
assistance 55
pumping 7
wages 26
forcing 24
sites 21
known 173
contributing 16
influence 60
subordinate 8
spur 16
military 154
fearful 6
falling 77
budget 225
constraints 8
encourages 7
burdens 9
ground 65
coming 171
decade 93
comes 114
swelling 7
evolution 10
concentrated 23
1990s 31
spurred 18
plants 148
accommodate 19
decisions 58
lender 10
california 370
graduate 12
parallel 11
approach 82
sectors 26
specialist 49
east 229
wilson 22
princeton 8
indonesia 11
effect 178
pull 25
integrated 64
closer 41
ministers 23
discuss 49
regional 93
transportation 158
telecommunications 63
participants 50
zealand 30
speech 48
baker 91
intention 19
taking 155
shape 33
friends 43
crucial 38
designing 11
architecture 16
difficult 122
dominance 10
flows 19
remains 164
optimism 14
convey 6
caution 29
understanding 18
functions 20
attitude 33
net 770
gain 292
everyone 90
step 100
ease 69
security 188
uncertainty 70
leases 19
bases 27
troop 8
regard 16
desirable 14
try 142
lee 56
pennsylvania 43
rice 20
hardly 33
eyes 29
comprehensive 35
test 138
basic 52
skills 24
ninth 7
greenville 16
spotted 10
seen 136
cheating 16
notes 316
profession 11
germany 183
surrendered 8
passed 87
forms 37
word 55
matched 20
answers 32
section 93
protest 21
my 303
teacher 20
ok 13
me 154
nancy 10
yeargin 37
students 87
parents 63
confronted 6
examination 21
geography 7
classes 34
gone 64
display 28
prosecuted 6
unusual 66
carolina 47
breach 15
pleaded 26
guilty 68
alternative 56
jail 21
partly 111
won 119
inspired 15
teach 14
wake 58
anger 12
colleagues 52
defended 17
treated 13
stunned 12
nature 49
actions 71
light 114
dark 18
reform 72
teachers 31
testing 36
enhanced 17
temptation 9
statute 15
violated 24
enforce 11
provisions 100
laws 76
alleged 71
bolster 28
scores 30
bonus 20
education 91
depended 7
ability 106
incredible 6
pressure 155
walt 16
educators 9
wrongdoing 17
n.m. 8
concluded 50
outright 10
standardized 10
greatly 28
inflated 10
widespread 42
surfaced 14
states 203
suspects 10
adult 10
wrong 75
ones 79
statewide 7
numerous 43
practices 64
booklets 6
classroom 13
instruction 7
booming 17
scoring 14
learning 33
nothing 133
sophisticated 44
academic 27
telegraph 32
precise 10
concentrate 30
county 88
district 143
experts 85
promotions 21
entire 82
districts 31
extra 53
lab 7
grants 33
projects 137
reforms 45
posts 26
lowest 26
sat 27
primary 66
critics 63
stressing 6
worst 50
administrators 9
seriously 26
allegations 43
foundation 41
unfair 27
worries 26
abuse 25
keeping 60
track 49
preparation 12
textile 18
educated 6
governors 13
nobel 11
prize 10
winning 30
actress 7
1980s 53
glory 10
faded 8
yellow 14
bricks 9
broad 76
violence 19
gangs 6
kids 32
linda 13
ward 20
awful 12
programs 237
seventh 16
immediate 58
predecessor 14
suffered 54
nervous 39
breakdown 14
prior 62
term 112
death 91
halls 8
trouble 86
serving 24
evenly 9
split 70
elite 9
neighborhoods 18
blacks 58
inner 14
resolved 29
clean 39
faculty 7
restore 27
safety 91
behalf 36
overall 105
educational 41
funding 103
ambitions 8
reformers 9
dismissal 14
loved 11
things 214
restructured 18
staff 134
struggled 11
fast 48
favorite 28
encouraged 37
taught 14
creation 21
encourage 40
teaching 12
advised 28
cultural 19
chosen 27
lady 10
freshman 7
studying 27
beth 6
've 215
green 57
distinguished 6
herself 14
approaches 13
pair 10
prepare 21
furniture 21
'd 113
stands 37
football 48
fellow 43
told 227
pushing 46
deteriorating 14
hearing 61
feared 25
helping 47
earn 32
points 368
source 117
meant 35
meaningful 8
salary 22
third 453
others 262
eager 34
pride 17
elizabeth 17
indeed 127
interested 86
attending 12
returned 59
adequately 8
studies 56
admits 24
mistake 15
correct 28
subjects 16
bottom 49
newspapers 59
mostly 85
prevent 86
badly 45
broke 38
heart 66
whole 109
alive 20
desperately 11
somebody 26
blow 29
advanced 117
pretty 72
joe 16
watson 14
prosecutor 17
concedes 24
adding 92
hands 93
discovered 54
avoid 99
disclosure 31
trial 103
quiet 41
resignation 47
save 57
certificate 12
recalls 42
someone 78
authorities 54
dismissed 29
crowded 18
testify 17
supportive 9
callers 7
radio 92
policies 86
host 36
allowed 105
first-time 6
offenders 7
conviction 26
worthy 8
murder 21
witnesses 21
interviewed 22
crushed 6
explain 38
familiar 92
shirts 8
angry 24
harm 14
damn 8
incident 15
doubt 63
wisdom 17
evaluating 11
realized 30
afraid 21
relieved 14
sentiment 27
favor 69
jury 77
touched 8
slate 17
answer 43
widely 100
roman 35
add 96
parent 178
britain 166
communication 19
parallels 8
mich. 40
gauge 15
eighth 8
grade 8
cat 8
iowa 29
metropolitan 49
arizona 68
florida 74
louisiana 13
maryland 28
tools 28
kean 10
publishes 17
aimed 79
improving 27
referred 21
michigan 32
similarity 6
devised 10
scale 35
measured 25
metric 46
measurement 6
volume 318
pie 8
bar 34
intent 34
knowledge 19
sounds 23
exclusion 12
contains 16
examples 9
matches 7
rick 8
ignoring 20
need 262
format 12
deny 28
publication 25
random 24
advisory 25
represented 39
sacramento 26
loan 266
c. 66
s&l 38
offices 105
north 168
services 374
fetal-tissue 10
transplants 16
tissue 16
humans 13
anti-abortionists 7
oppose 33
abortions 34
mason 39
transplant 7
indefinitely 11
wo 301
stop 108
privately 49
funded 25
federally 19
involve 35
hhs 7
louis 49
sullivan 25
letter 113
acting 34
institutes 14
threatened 43
controversy 30
implications 26
brain 31
patient 18
suffering 20
scientific 48
ethical 11
majority 142
panel 80
recommended 31
carefully 23
controlled 65
anti-abortion 14
dispute 73
hampered 15
administration 355
recruit 7
prominent 23
doctors 27
fill 33
prestigious 12
helm 6
nih 16
withdrawn 15
names 55
consideration 30
views 53
antonio 19
novello 6
serve 55
surgeon 7
reportedly 26
assured 16
opposes 13
charged 70
imposing 13
ideological 13
moves 108
judgments 9
applications 40
associate 32
dean 44
yale 19
debate 75
mechanism 13
exists 10
middle 45
conducting 18
warns 14
discourage 11
climate 30
visible 21
foundations 9
fronts 8
damaged 64
genes 42
cause 103
syndrome 12
mental 10
summary 7
interstate 54
over-the-counter 101
slightly 163
lackluster 25
turnover 36
busiest 9
averaged 23
roughly 76
biggest 178
gained 160
modestly 29
tracks 24
connecticut 33
trust 263
regions 19
merge 31
massachusetts 39
merged 26
traders 473
real-estate 102
takeover 310
targets 43
speculators 35
anticipating 13
approve 45
permitting 8
immediately 80
water 112
saw 85
uptick 7
trader 110
otc 93
bancorp 17
expires 26
ed 11
fared 12
constitution 36
signed 100
merger 122
l.p. 8
london-based 15
third-quarter 333
pretax 101
mobile 15
dan 19
one-time 55
substantially 66
losses 324
associated 66
core 68
assuming 36
dramatic 34
achieve 23
weisfield 16
ratners 15
definitive 34
jaguar 198
heritage 21
media 121
acquiring 48
pop 26
swap 32
tumbled 52
rally 156
lost 206
restaurant 48
operator 56
redeemed 14
resolve 31
burt 12
sugarman 16
trotter 12
sci 57
slipped 55
ala. 6
fiscal 289
quarter 962
sept. 208
year-earlier 165
criminal 84
detailed 30
warnings 14
attorneys 57
cities 61
outcry 15
organized 30
protected 25
privilege 17
irs 103
stem 26
receives 18
customer 95
transactions 116
payment 100
document 14
failure 73
punishable 8
felony 13
prison 46
argued 53
wish 30
citing 61
rarely 22
acted 18
witness 21
neal 13
miami 41
dozens 24
letters 45
sent 123
certified 7
mail 64
drug 231
individuals 91
necessarily 28
hire 28
circumstances 43
retained 27
filling 18
spark 14
formed 53
gerald 22
delegates 6
resolution 57
requirement 17
aba 6
grand 82
prohibited 12
ethics 20
disclosing 6
committing 6
justice 128
taxpayers 51
notice 28
moderate 45
stance 23
christopher 33
detroit 37
submit 19
initiated 10
dating 9
permission 32
obtained 28
develop 94
sending 23
relating 16
confidential 10
judicial 29
salaries 20
victim 22
judges 55
lucrative 22
fanfare 7
ramirez 7
calif 48
san 367
francisco 268
refusal 12
couple 72
professional 74
accountants 12
eye 53
sudden 43
sum 16
litigation 73
detail 19
high-priced 11
troubles 45
laughing 6
trudeau 7
guild 10
america 235
alleging 14
mounted 14
punish 7
crossing 7
picket 6
involves 22
productions 11
member 114
employed 22
lawsuit 45
illegally 20
reviewing 19
suit 199
disciplinary 14
k. 14
consists 17
mainly 69
threats 14
punishment 8
damages 59
seeks 45
preventing 12
adopted 50
prohibits 9
title 48
x 8
assist 23
obtaining 14
counseling 14
activities 89
promote 33
advocate 10
opinion 64
restrictions 80
violate 20
care 134
limits 48
pregnant 20
inquiry 30
clears 7
bias 21
comments 45
homosexual 6
dallas 71
jack 62
sparked 18
remarks 36
december 132
sentencing 7
defendant 22
killing 25
park 76
referring 30
picking 21
boys 23
murray 16
appointed 41
fairness 13
commenting 10
judiciary 15
impose 25
gaf 20
opening 96
arguments 28
manhattan 84
lowe 6
indictment 27
wayne 12
n.j. 66
specialty 51
sherwin 8
attempting 35
manipulate 8
carbide 18
trials 12
switching 9
prosecution 18
affair 23
mayer 8
brown 76
oliver 17
d.c. 34
specialize 7
white-collar 11
served 53
narcotics 6
tire 24
rubber 13
principle 36
albany 6
ga. 12
inc 294
consist 11
square 51
feet 85
acres 27
bids 90
leaders 155
statement 183
pricing 59
equivalent 44
penny 12
municipal 78
no. 69
alone 97
competitors 90
auctions 14
summoned 8
sure 112
understood 18
fair 55
investigating 24
violations 40
packed 9
headquarters 98
contrary 18
sorry 7
embarrassing 10
situations 10
reputation 40
profits 174
benefits 120
accepted 61
normal 69
accepting 16
gifts 11
businessmen 28
fire 61
fueled 24
behavior 32
complaints 36
touch 23
foreigners 27
complain 28
limited 152
access 74
procurement 7
unfairly 12
undercut 10
slashing 8
semiconductors 10
hurt 129
minus 12
factor 47
hiroshima 11
design 75
waterworks 7
library 11
municipalities 8
emerge 21
insisted 28
contacted 8
federation 22
papers 38
atlantic 47
publications 28
community 133
cbs 119
communications 164
retaining 9
operates 61
retail 167
furukawa 8
machinery 39
locally 7
german 161
structural 49
productivity 31
thrifts 70
compiled 23
monitor 35
b 45
minimum 110
lsi 6
logic 15
surprise 37
semiconductor 46
lagging 13
billings 12
cover 81
extended 53
weakness 67
switch 28
techniques 16
wilfred 7
midyear 8
phase 22
oldest 7
appropriate 37
counting 17
extraordinary 51
older 58
silicon 19
converting 11
santa 87
clara 12
calif. 149
facility 75
speculate 15
additions 7
aggressively 32
suddenly 35
poorly 16
positioned 13
stark 14
robertson 23
dead 38
facing 45
traditionally 27
buyers 172
jitters 10
lake 22
n.j 19
g. 37
buoyed 14
cautiously 9
bearish 24
kept 78
plunging 12
locked 16
narrow 37
offset 100
resulting 49
jay 19
insight 6
reasons 69
lure 15
driving 35
tom 34
banque 11
paribas 70
convinced 25
erode 11
sterling 63
thursday 133
madison 20
los 194
angeles 164
solid 32
wave 39
waiting 70
wings 12
contends 45
perception 20
columbia 162
entertainment 118
cites 12
knight 20
undisclosed 12
georgia-pacific 61
northern 78
nekoosa 52
10-year 51
valued 93
speculation 95
unclear 19
rolled 20
prospect 42
lock 24
high-yield 67
merely 43
drifted 9
release 71
expectations 85
minimal 16
commodity 90
ounce 55
ounces 21
cosby 13
ratings 71
nbc 81
debut 19
keeps 16
viewers 40
network 198
affiliates 24
air 287
considerably 25
episodes 9
distributor 21
viacom 36
losing 67
persuade 24
tactics 16
willing 94
negotiate 23
midwest 29
tell 87
'll 140
flooded 8
networks 64
station 58
a.c. 9
nielsen 10
r.i. 6
n.c. 16
louisville 21
ky. 17
renew 9
dick 16
disappointment 17
pleased 24
adds 144
disappointed 30
uncomfortable 6
frankly 11
quite 71
georgia 48
officially 27
atlanta-based 9
conventional 60
life-insurance 7
magazines 79
articles 28
survive 27
downright 7
garbage 14
billed 8
practical 16
founded 31
brooklyn 19
n.y. 50
entrepreneur 17
promise 51
crisis 59
combines 6
pieces 32
topics 10
happens 31
flush 6
toilet 8
editors 13
considerable 37
supermarket 15
identify 38
guys 25
feature 18
standpoint 7
would-be 13
campbell 37
soup 21
microwave 6
premiere 12
column 18
pointing 10
packaging 37
foam 6
plastic 42
landfill 9
monster 6
wrote 72
practicing 9
opportunity 82
modifications 8
printed 15
portrayed 7
surprisingly 30
turning 46
mike 16
ddb 7
needham 10
economics 37
big-time 8
handful 36
coors 30
spend 97
relied 11
haul 11
print 25
publisher 51
initially 52
subscription 9
revenues 43
yearly 10
recycled 6
scared 17
replies 8
sleep 12
interpublic 16
programming 36
expanded 44
original 79
largely 143
supplier 30
philadelphia 46
palmer 6
handled 31
baltimore 40
at&t 57
fax 10
ogilvy 43
mather 18
wpp 24
rubicam 21
enterprise 16
breaks 22
st. 71
specializes 17
pitches 8
pittsburgh 48
sea 60
containers 35
buy-back 38
pressed 15
temple 15
hamilton 13
shipping 50
proceeds 90
apiece 17
hostile 61
ag 70
sweetened 16
approximately 35
allocated 11
leaving 66
flexibility 27
raises 30
criticized 36
conditional 6
device 35
superior 20
asset 94
converted 25
possibility 53
subsidiaries 37
mired 9
barred 18
reaction 56
responding 21
advocates 26
steps 75
vans 16
requirements 77
automobiles 12
requiring 35
minivans 9
belts 9
rear 6
model 67
samuel 25
skinner 16
represents 74
ongoing 14
vehicle 55
extension 28
car 218
equipped 10
surprising 41
urging 30
actually 116
cargo 21
therefore 28
luck 11
reagan 94
fairly 59
address 38
chuck 6
highway 56
sen. 145
praised 11
noting 39
crashes 6
bags 13
automatic 25
weighing 8
pounds 32
withstand 11
weight 30
depressed 29
inches 16
shoulder 12
installed 23
deadline 36
engineer 14
ford 234
crew 11
rail 17
autos 9
heights 11
ill 25
railroad 25
sir 60
walters 6
petroleum 80
joins 11
cement 15
circle 16
formal 40
longstanding 18
opposition 96
within 243
dow 333
jones 287
options 220
conversations 18
interesting 28
prevailing 8
passage 17
slump 35
lay 18
altogether 21
employment 62
exclusively 13
leasing 29
reduced 144
payable 35
jan. 51
hair 16
accessories 14
cosmetic 8
year-ago 77
anti-takeover 12
henderson 15
u.k. 94
metals 62
succeeding 31
ian 7
butler 15
retiring 15
cent 23
redemption 23
upon 54
warren 32
leap 13
wine 33
tag 7
cabernet 6
shops 39
experience 75
declared 56
diamond 21
creek 14
weighed 9
bottle 18
fastest 7
segments 29
category 32
wines 16
quality 110
perceived 15
stable 37
la 50
magnitude 11
flashy 7
releases 17
lion 14
bottles 8
smallest 10
lighter 9
vintage 8
prestige 8
barrier 17
salon 7
soared 65
steal 12
precious 35
anywhere 21
angelo 10
command 20
larry 17
shapiro 10
happening 27
scarce 10
exhausted 9
newer 12
bargain 24
perfectly 15
yielded 7
owner 76
al 10
originally 32
retailer 42
wholesale 41
merchants 18
check 44
responses 16
yes 28
shipped 22
spread 80
thin 42
retailers 58
suburban 22
opinions 16
thinks 65
dramatically 11
wins 19
talked 20
excited 6
collection 47
sort 69
dunn 6
appeal 71
explains 29
rapidly 49
knowledgeable 10
orleans 16
equally 18
movement 50
forced 111
push 71
lowering 16
beautiful 14
ideas 32
walking 14
door 50
moment 65
looming 6
holidays 7
free-lance 8
upward 31
richmond 19
posting 19
fourth 148
agrees 24
kansas 25
stated 29
objective 15
hopefully 8
downward 35
expecting 28
easier 45
plunge 153
shown 57
weak 84
slower 36
discretionary 12
halt 53
divided 37
presidents 22
excesses 10
tilt 7
chance 90
mailing 9
exercised 13
hotels 25
exercise 60
merchant 40
steelmaker 17
steelworkers 8
tube 9
expired 20
vote 146
reject 26
pact 53
postponed 16
congressional 132
fails 14
disruption 12
schedule 37
taxpayer 11
nicholas 25
brady 54
redeem 18
maturing 22
refunding 16
three-year 33
auctioned 11
30-year 79
when-issued 7
approves 7
clearing 31
two-year 45
five-year 38
estimates 165
decides 16
aim 27
lancaster 5
foods 43
marketer 14
frozen 16
pasta 9
advantage 65
fractionally 6
finished 58
advancing 20
enthusiasm 14
rushed 18
sight 8
pattern 31
benchmark 66
afternoon 80
mitsui 18
mining 48
eaton 11
sierra 18
supplies 70
harold 19
simmons 38
nl 17
gulf 87
chemicals 76
restructure 27
rebuffed 9
alternatives 45
proposals 67
reviewed 9
regarding 42
eliminated 28
various 106
proof 15
aggressive 54
pit 22
bull 19
morgan 141
stanley 95
valhi 6
two-thirds 41
surprised 42
cited 85
becomes 41
unchanged 105
proposing 17
subordinated 77
junk-bond 73
collapsed 46
likelihood 14
hundred 32
agreeing 19
consent 28
jerry 21
respond 36
solicitation 13
replacing 16
friendly 45
apparently 108
nominal 14
earned 128
licensing 9
representing 54
challenging 15
punitive 11
license 33
elsewhere 65
albert 20
researcher 18
1960s 24
combat 23
licensed 13
criticism 50
acquisitions 76
color 52
disagree 16
removal 12
barriers 29
focusing 25
differences 52
initiative 55
rhetoric 13
signal 51
impending 15
nervousness 8
devoted 12
half-hour 19
briefing 7
journalists 18
notably 22
coca-cola 32
fuel 49
fires 12
publicized 9
boone 7
pickens 7
jr 11
lloyd 73
highlight 10
disproportionate 11
table 39
structures 28
recommendations 21
anxious 18
successful 71
concessions 24
clarify 6
exactly 41
quick 53
crossed 8
smaller 129
controversial 48
improves 10
provides 92
candela 6
laser 12
high-tech 19
sights 7
tiny 29
joint-venture 10
bureaucratic 11
secured 36
kidney 12
stones 10
skin 15
count 25
promising 18
frequently 42
putting 69
financed 25
corporations 79
minority 80
heightened 13
acceleration 7
deals 102
feed 17
glass 56
catch 32
fancy 15
strategic 63
fit 32
va. 30
architectural 8
ronald 28
window 22
merchandise 46
inside 44
counterpart 12
commodities 44
ships 32
u.s.a. 12
houses 82
ventures 70
goal 61
objectives 19
drive 77
basis 146
performed 26
businessman 21
alliance 48
generate 38
extent 53
ai 7
hudson 22
departure 34
maintenance 41
fueling 9
airlines 202
airports 16
omitted 14
duties 31
assumed 28
neighborhood 25
convenient 7
crown 14
package 96
checking 7
safe 55
deposit 63
card 46
installment 10
qualify 20
loyalty 36
competitive 75
deposits 75
packages 34
targeting 14
population 50
anne 11
moore 23
ncnb 31
charlotte 17
connections 6
adults 21
starting 71
throws 11
saving 18
memphis 8
tenn. 13
edge 28
crowd 33
borrowed 31
aiming 9
elderly 24
segment 69
stepped 25
macdonald 9
barnett 5
fla. 34
seniors 7
styles 11
create 97
branches 46
athletic 7
travel 77
active 121
games 57
panama 62
wells 57
fargo 23
travelers 25
checks 28
fee 30
slew 6
promoting 21
margins 97
profitable 74
mid-1970s 11
emphasis 28
switched 20
ways 121
enabling 9
analyze 11
deregulation 15
1970s 50
cds 57
certificates 59
staggering 11
bigger 66
market-share 6
banker 51
worrying 10
unions 32
scrambling 14
define 6
n.c 9
attracting 19
costly 51
rewarding 7
bulk 34
audience 55
loyal 24
borrowers 15
personnel 50
training 55
promotional 18
jacob 7
demanding 14
tailored 6
moving 90
direction 62
alvin 6
realize 46
iras 11
registration 19
chandler 16
ariz. 27
exercisable 16
develops 10
low-cost 13
peripheral 6
chevrolet 20
vacation 12
send 36
lasting 9
savings-and-loan 18
foster 26
ailing 11
demise 11
healthy 66
performing 19
institution 49
gift 10
doors 21
felt 63
lewis 31
builds 11
confidence 70
critical 52
delay 63
worse 54
sagging 11
morale 7
mercantile 35
breaker 12
stemming 19
phelan 57
subcommittee 49
halts 10
collar 10
arguing 22
limit 116
merc 42
one-hour 11
stock-index 131
futures 445
s&p 164
p.m 12
execute 17
trades 102
tumultuous 8
industrials 50
skidded 12
hitting 14
remained 66
session 121
existing 92
equal 64
leo 7
panic 58
reopened 14
subsequent 29
flood 11
knocked 19
intermediate 19
floor 126
shortly 49
maximum 42
one-day 14
minutes 107
aides 26
congressmen 13
executing 9
expressed 53
volatility 126
program-trading 32
comfortable 35
capitol 27
legislators 29
shut 35
volatile 56
breeden 41
breakers 30
trigger 16
vague 10
angered 10
edward 52
markey 12
beyond 93
done 139
sensitive 38
happy 30
writing 33
discussed 29
congressman 21
attended 22
dingell 17
let 131
sources 77
regulated 15
agriculture 37
committees 28
rural 29
ancient 8
stone 29
church 54
bells 23
tower 41
calling 49
angels 13
ropes 6
sounded 6
modern 46
enjoying 10
cool 23
autumn 14
band 19
ringers 24
herald 20
sunday 52
ringer 6
hammond 14
live 76
youngsters 6
ring 14
worker 40
train 28
youth 24
ranks 22
nationwide 38
continental 72
invented 10
physical 18
weigh 12
ton 26
concentration 7
proper 20
bell 88
methods 16
ten 11
pulling 16
disappears 7
hole 14
ringing 10
chamber 38
speaks 9
totally 31
absorbed 11
vision 20
thus 121
pulls 7
wheels 7
skilled 7
well-known 27
novelist 7
passion 8
finds 24
satisfaction 19
filled 41
bit 63
stays 12
stuck 22
sweat 8
sit 36
steadily 29
pressing 19
attend 9
rev. 10
vicar 7
